{"google": {"overview": {"description": "A problem isn't truly solved until it's solved for all. Googlers build products that help create opportunities for everyone, whether down the street or across the globe. Bring your insight, imagination and a healthy disregard for the impossible. Bring everything that makes you unique. Together, we can build for everyone.\n\nCheck out our career opportunities at goo.gle/3DLEokh", "image": "https://media.licdn.com/dms/image/C4D0BAQHiNSL4Or29cg/company-logo_200_200/0/1519856215226?e=1700092800&v=beta&t=0Y3ciUgv_KYXdD9KXF1VgUvgbyH_SdGAr4uEwgQOAgA", "name": null, "num_employees": 285066, "metadata": {"website": "https://goo.gle/3DLEokh", "industry": "Software Development", "company_size": "10,001+ employees\n285,066 on LinkedIn Includes members with current employer listed as Google, including part-time roles. Also includes employees from subsidiaries: YouTube,CapitalG,X, the moonshot factory and 1 more.", "headquarters": "Mountain View, CA", "specialties": "search, ads, mobile, android, online video, apps, machine learning, virtual reality, cloud, hardware, artificial intelligence, youtube, and software"}}, "jobs": null, "life": null, "insights": {"6m change": null, "1y change": null, "2y change": null}}, "amazon": {"overview": {"description": "Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. We are driven by the excitement of building technologies, inventing products, and providing services that change lives. We embrace new ways of doing things, make decisions quickly, and are not afraid to fail. We have the scope and capabilities of a large company, and the spirit and heart of a small one.\n\nTogether, Amazonians research and develop new technologies from Amazon Web Services to Alexa on behalf of our customers: shoppers, sellers, content creators, and developers around the world.\n\nOur mission is to be Earth's most customer-centric company. Our actions, goals, projects, programs, and inventions begin and end with the customer top of mind.\n\nYou'll also hear us say that at Amazon, it's always \"Day 1.\"​ What do we mean? That our approach remains the same as it was on Amazon's very first day - to make smart, fast decisions, stay nimble, invent, and focus on delighting our customers.", "image": "https://media.licdn.com/dms/image/C560BAQHTvZwCx4p2Qg/company-logo_200_200/0/1612205615891?e=1700092800&v=beta&t=GXHsGJ6-oPRVdGp2bBkYyV5tS7A1GG9A2OEKL8KeSK0", "name": null, "num_employees": 826372, "metadata": {"website": "https://www.aboutamazon.com/", "industry": "Software Development", "company_size": "10,001+ employees\n826,372 on LinkedIn Includes members with current employer listed as Amazon, including part-time roles. Also includes employees from subsidiaries: Amazon Web Services (AWS),Goodreads.com,Audible and 21 more.", "headquarters": "Seattle, WA", "specialties": "e-Commerce, Retail, Operations, and Internet"}}, "jobs": null, "life": null, "insights": {"6m change": null, "1y change": null, "2y change": null}}}