[
{"title": ["30 Golden Rules of Deep Learning Performance"], "author": ["Siddha Ganju"], "description": ["“Watching paint dry is faster than training my deep learning model.”", "“If only I had ten more GPUs, I could train my model in time.”", "“I want to run my model on a cheap smartphone, but it’s probably too heavy and slow.”"], "date": "July 2020", "tags": ["Deep Learning", "Machine-Learning"]},
{"title": ["Everything You Know About MongoDB is Wrong!"], "author": ["Mark Smith"], "description": ["MongoDB is webscale, right? It's a JSON database, it's eventually consistent, and you use map-reduce to query it. Oh, and it's insecure."], "date": "July 2020", "tags": ["Big Data", "Data", "Databases", "Development", "MongoDB"]},
{"title": ["Flasync Await"], "author": ["David Bordeynik"], "description": ["Async is all the rage, mostly because it simplifies waiting for an operation that takes some time to finish. Python went all in on asyncio by changing the language to support it (async/await) iIn this microservices era where many of the applications we develop consume several 3rd party API services, async is the fast track to success. In this talk, I’ll demonstrate the benefits of going async for a web application, justify choosing Sanic over other web frameworks like aiohttp. I’ll do so by transforming a Flask backed application to a Sanic backed application. Finally, I’ll provide tips & tricks from my experience on measuring, monitoring and testing async code."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Abstractions", "Best Practice", "Web"]},
{"title": ["Ensuring data integrity with asynchronous programming in a cloud IoT core"], "author": ["Theofanis Petkos", "George Zisopoulos"], "description": ["Undoubtedly this will be the decade of low-cost and high-performance cloud IoT core development.", "All cloud IoT solutions will have to meet the same two fundamental requirements: Performance and Data Integrity. Having said that,  AsyncIO comes to mind.", "While researching similar topics on cloud IoT solutions, we noticed that the vast majority of such solutions primarily includes performance. In this discussion we would like to demonstrate how you can ensure that a low-cost, fast developed cloud IoT core can ensure that its data is not corrupted and is accurate  for the user.", "Technically speaking, it is very interesting to analyze how a bucket of async/await tasks can handle (consume or even produce) messages from or to message queues, interact with other (even non pythonic) modules inside the core, manage socket connections and many other functionalities that make Python3.6+ the heart of any IoT core. Note that it is equally important to check imported data with periodic tasks, acquire statistics from devices and sanitize database data in order to ensure data integrity.", "Our goal: Firstly, to encourage new developers to get involved with cloud IoT cores and use Python and AsyncIO as the heart of their core. Secondly, as new developers we would like to show our logic and our prefered python libraries and techniques in order to receive feedback from more experienced developers.", "We are a team of software engineers located in Athens, Greece working for a fast growing startup in San Francisco (", "). We have developed our own cloud IoT core for a vehicle fleet management SaaS."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Internet of Things (IoT)", "Python 3", "Software Design", "Use Case"]},
{"title": ["Find a new job - Sponsor Presentations"], "author": ["Marc-Andre Lemburg"], "description": ["Many of our sponsor are looking to hire more developers and EuroPython is the perfect place to reach out to many of them."], "date": "July 2020", "tags": ["Business", "Development", "Job Hunting", "Python Skills", "Workforce"]},
{"title": ["Extending HTTP for fun and non-profit"], "author": ["Roberto Polli"], "description": ["Writing API guidelines is a best practice for standardizing APIs produced by thousands of service provider, but what happens when those rules are not backed by internet standards?"], "date": "July 2020", "tags": ["APIs", "Best Practice", "Case Study", "Community", "HTTP"]},
{"title": ["Full Stack Type Safety"], "author": ["Szymon Pyżalski"], "description": ["The introduction of PEP-484 gave us an option to enforce the internal type consistency of our Python applications. Our web projects, however, consist of multiple layers, with the Python app taking the role of an HTTP backend. What options do we have to ensure consistency across our stack?", "In this talk, we will see some technologies that we can employ to enforce the contract between the layers of our stack. Especially between the frontend and backend. We will demo, how this can be achieved with REST/Swagger and with GraphQL. As both the Graphene library and the open API support for django-rest-framework are both a work-in-progress, we would check, what is possible, and what is still lacking. We will also discuss various approaches to the design: backend first, auto-generating backend from the spec, and TDD, with their advantages and disadvantages.", "The topic would be discussed on a simple web application. We would try to play some realistic scenarios, where a careless developer breaks the contract to see how such a mistake can be spotted in the CI phase of the development cycle.", "Basic knowledge of Django and JavaScript is required to understand the talk. Some familiarity with TypeScript and ReactJS would also be helpful. However, I plan to explain the code to the listeners that didn’t have prior exposure to these technologies."], "date": "July 2020", "tags": ["APIs", "Django", "JavaScript", "Type-Hinting", "Web Protocols"]},
{"title": ["gRPC Python, C Extensions, and AsyncIO"], "author": ["Lidi Zheng", "Pau Freixes"], "description": ["Goal - Encourage Python developers to understand C extensions by sharing gRPC Python’s practice, and advocate the adoption of AsyncIO."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "CPython", "Cython", "Performance"]},
{"title": ["Extending Python with Rust"], "author": ["Mikhail Medvedev"], "description": ["Rust is a rising star of the programming language world. I'd like to discuss it from a Python developer perspective. Obviously, Rust is not a replacement for Python, but in case you're seeking better performance it may be a good idea to build an extension. This is safer and arguably easier to do in Rust than in C.", "In this talk we will take a look at existing crates that provide interface to Python and see how easy it is to use them.", "Then we go through the demo and see it in action.", "Run some benchmarks against pure Python and also Cython.", "Write a Dockerfile to build it all together.", "Discuss CI/CD for mixed Rust/Python projects."], "date": "July 2020", "tags": ["All Other Programming Languages", "Compiler and Interpreters", "Deployment/Continuous Integration and Delivery", "Docker", "Rust"]},
{"title": ["Growing a Python Community at an Enterprise Scale"], "author": ["Mario Corchero", "Marianna Polatoglou"], "description": ["The talk will showcase how the Python community started and took off in Bloomberg, and how it can serve as a model that can be used within other companies as well. This includes details on how Bloomberg's Python community got started and grew to the place that it is today, as well as tips from its leaders personal experiences."], "date": "July 2020", "tags": ["Community"]},
{"title": ["Elegant Exception Handling"], "author": ["Eyal Trabelsi"], "description": ["Error handling is hard. Regardless of the approach you take, it usually means littering your application with checks and validations that greatly reduce code readability. So how can we tackle exceptions?"], "date": "July 2020", "tags": ["Python Skills", "Python general", "python"]},
{"title": ["Effective Code Reviews"], "author": ["Vinicius Gubiani Ferreira"], "description": ["Does your company uses code review? In this talk I will demonstrate why it should start using them immediately, share the many benefits and situations we've gone through, besides good practices that should be used for effective code reviews, that add quality to the product/service that is being delivered."], "date": "July 2020", "tags": ["Agile", "Best Practice", "Clean Code", "Code Analysis", "Communication"]},
{"title": ["Django Testing on Steroid: pytest + Hypothesis"], "author": ["Bojan Miletic"], "description": ["The talk should hopefully provided value to all listeners, regardless of their knowledge level, but preferably you have some knowledge of pytest test parametrization"], "date": "July 2020", "tags": ["Django", "TDD", "Test Libraries (pytest/nose/...)", "Testing"]},
{"title": ["Django Clone From Scratch With Flask"], "author": ["Abdur-Rahmaan Janhangeer"], "description": ["With Python, when thinking of web frameworks, two that come into mind are Django and Flask. Instead of having to choose one of the two, this session shows how you can engineer Flask to achieve a simili-Django app. It's a dive into the internal components of Django and the idea behind. The session covers different Flask development patterns to finally finish with an app that's functionally similar to Django with some extra features in for free. It also lists some caveats identified with such a pattern. This session requires attendees to know Flask and having used Django for building at least one project. At the very least it assumes the knowledge of models, views, controller, templates and migrations. It discusses along the way the educational and pedagogical aspect of learning web frameworks and proposes a syllabus. It discusses the benefits of learning Flask and the necessity of learning the two as a Pythonista. Django is the go-to framework for web development and it's no surprise that most freelancing jobs require Django. Flask is appreciated for the flexibility it gives. The session also touches about how we can better promote Flask through education. The session finishes with the hurdles identified when getting started with web development in Python, pulled from personal teaching experience."], "date": "July 2020", "tags": ["Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["Docker and Python: making them play nicely and securely for Data Science and ML"], "author": ["Tania Allard"], "description": ["Docker has become a standard tool for developers around the world to deploy applications in a reproducible and robust manner. The existence of Docker and Docker compose have reduced the time needed to set up new software and implementing complex technology stacks for our applications. Now, six years after the initial release of Docker, we can say with confidence that containers and containers orchestration have become some of the defaults in the current technology stacks."], "date": "July 2020", "tags": ["Conda / conda forge", "Data Science", "Deep Learning", "Machine-Learning", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Taking Part in the Greatest Experiment in History"], "author": ["lil anonymous"], "description": ["In the last few weeks, one of the largest and most exciting experiments in the history of mankind has taken place, with over  900 million children in over 190 countries being the recipients of online (virtual) education. "], "date": "July 2020", "tags": ["Education"]},
{"title": ["EuroPython 2021: Help us build the next edition!"], "author": ["Marc-Andre Lemburg"], "description": ["We need help with organizing and running EuroPython 2021."], "date": "July 2020", "tags": ["Community", "EuroPython", "EuroPython Society (EPS)"]},
{"title": ["Digital Transformation in the fight against Coronavirus"], "author": ["Bruno Ferreira"], "description": ["The Corona Virus - COVID-19 pandemic caused a significant impact on public services. In particular, it brought a massive digitalization of services that were offered in person. In addition, there was a great deal of pressure on official channels, whether to seek a service or to report a fact. Qualified and official information becomes an element in combating the pandemic. Knowing where to look for information, reporting a fact or getting a qualified response are essential steps to maximize the efficiency of the citizen's decision-making process, especially in a scenario of such uncertainty. The State has a fundamental role, whether as an inducer, executor or provider of the means necessary for information and decision-making to be effective at that time.", "Connected by the growing demand, the State of Goiás, through the State's Comptroller General, published a series of technological tools with the objective of bringing information to the citizen, promoting social control and improving public policies to fight the Coronavirus.", "This document seeks to show how technological tools were adopted and implemented in terms of transforming the ombudsman channels in the State of Goiás through the State's Comptroller General in actions to combat the Coronavirus pandemic. The document seeks to show how the transformation of the ombudsman channels occurred through machine learning techniques and data visualization."], "date": "July 2020", "tags": ["PyPi", "PyPy", "Python Skills", "Python general", "R"]},
{"title": ["The Phantom of Radon"], "author": ["Francesca Tedeschi"], "description": ["This project contains an open source Python library for image reconstruction in Axial Computed Tomography (TAC), based on the analytical Radon transforms of some classes of phantoms. ", "The package is available on GitHub at the following address: ", ".", "The mathematical phantoms are fictitious images, composed of very simple geometric figures (ellipses, squares and rectangles) that, sampled with the Radon transform allows to build a fictitious signal, called (exact) sinogram.  Using a phantom gives the advantage to test the reconstruction algorithm on a zero-noise data so the error we get is only due to numerical inaccuracies in the algorithm itself. We want to calculate two reconstructed images from the approximated and exact sinograms, obtained applying the iradon function of the Python library scikit-image on both of them. We expect a smaller error on the exact reconstructed image. This turns to be true on continuous regions, but near the discontinuities of the phantom the Gibbs phenomenon prevents us to obtain the same enhancement."], "date": "July 2020", "tags": ["Education", "Image Processing", "Open-Source", "Science", "Teaching"]},
{"title": ["Simulation of logistic systems in Python with salabim"], "author": ["Ruud van der Ham"], "description": ["Discrete event simulation is a very powerful technique in many fields, like transport, warehousing, hospitals, manufacturing and logistics.", "There are several commercial packages that provide high end GUIs to design a system and to animate the operations. These  packages are neary always close source and are very expensive (think USD 10-20 K per user). Often implementing complex algorithms is cumbersome.", "On the other end of the spectrum are open source packages that use existing program languages. Python is particularly interesting because of the vast number of (scientific) packages, like machine learning, statistics and databases.", "In te Python landscape there is SimPy, that is rather limited in functionality. In this poster I will present my discrete even simulation package called salabim. Salabim uses coroutines via generators and makes it very easy to model complex systems. The package offers advanced real time (2D) animation, monitoring and statistical sampling.", "I will show some applications and how a simple model is built up."], "date": "July 2020", "tags": ["Algorithms", "Engineering", "Robotics", "Use Case", "Visualization"]},
{"title": ["Resurrecting a django project in python 2.7 for 3.8"], "author": ["Griffith S Rees"], "description": ["Goals: "], "date": "July 2020", "tags": ["Django", "GEO and GIS", "Git", "Testing", "legacy-code"]},
{"title": ["Reduce hardware costs in Internet of Things using Python"], "author": ["Vijay Sajjanar"], "description": ["I guide students in developing systems which are real world and need less hardware. This is possible in 2 steps. One,reduce collecting data which is already available online. Two, compute on cloud instead on the hardware."], "date": "July 2020", "tags": ["Beginners", "Case Study", "Data", "Internet of Things", "Web Crawling"]},
{"title": ["Durable Functions: A More Durable Azure Function"], "author": ["Joseph Song"], "description": ["Serverless functions-as-a-service lets you run event-triggered code without having to explicitly provision or manage infrastructure. While they are powerful, they also have limitations. In this talk, we’ll discuss how Durable Functions can overcome the limitation by extending Azure Functions to let you write stateful functions in a serverless compute environment."], "date": "July 2020", "tags": ["Infrastructure", "serverless"]},
{"title": ["Radio Astronomy with Python"], "author": ["Priscila Gutierres"], "description": ["Looking at higher redshifts is equivalent to looking back in time: they improve the studies of cosmology, expanding our knowledge of the universe. It allows us to study various physical phenomena like the power spectrum of galaxies which describes the distribution of galaxies on a range of scales, galaxy clustering, and large scales, the detection of the Baryon Acoustic Oscillation feature. ", "As a result,  a significant amount of work has been done to increase the efficiency and accuracy of the process via new algorithms and optimization of existing ones.", "Astronomical datasets are undergoing a rapid growth in size and complexity as past, ongoing and future surveys produce massive multi-temporal and multi-wavelength datasets, with huge information to be extracted and analyzed.", "The alternative to a full spectroscopic survey is to obtain multi-color images of the sky and perform photometric redshift estimates for the galaxies we have available. ", "When dealing with this problem, there are two main approaches: model-driven data analysis (template fitting methods) and data-driven analysis, which can use machine learning methods.", "To solve this problem, we use data-driven analysis, more specifically GPz (which uses Gaussian processes)  and  ANNz2 (which mainly uses neural networks), both python software."], "date": "July 2020", "tags": ["Big Data", "Data", "Machine-Learning", "Physics"]},
{"title": ["Developing a match-making algorithm between customers and Go-Jek products!"], "author": ["Gunjan Dewan"], "description": ["GoJek has millions of monthly active users in Indonesia across our 20+ products and services. A major problem we faced was targeting these customers with promos and vouchers that were relevant to them. We developed a generalized model that takes into account the transaction history of users and gives a ranked list of our services that they are most likely to use next. From here on, we are able to determine the vouchers that we can target these customers with.", "In this poster, I will be presenting our process while developing the model, the challenges we faced during the time, how we used PySpark to tackle these challenges and the impact it had on our conversion rates."], "date": "July 2020", "tags": ["Data", "Data Science", "Machine-Learning"]},
{"title": ["Design and Simulate your Control Systems with Python, Why Not?"], "author": ["Brilian Putra Amiruddin"], "description": ["Many electrical engineering or control systems engineering students did not know that we can simulate our designed control algorithm with Python language, which is free and open source. In many colleges, to simulate the control algorithm it tends to use a paid programming language, but in many cases, the colleges did not provide the license for the students, so the students cannot afford it and ironically at the end, the students went to do an illegal act (software piracy)."], "date": "July 2020", "tags": ["Algorithms", "Engineering", "Programming", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Decision Science with Probabilistic Programming"], "author": ["Mattia Ferrini"], "description": ["Generative Models are the Swiss Army Knife for the Decision Scientist. Generative models allow the simulation of scenarios based on different business hypotheses (Bayesian priors). With Probabilistic Programming, decision makers can simulate the impact of business drivers in times of great uncertainty."], "date": "July 2020", "tags": ["Data Science", "Deep Learning", "Functional Programming", "Science"]},
{"title": ["Your Name Is Invalid!"], "author": ["Miroslav Šedivý"], "description": ["People have names. Most people do. People have first names and last names. Many people do. People have any sorts of names that often don't fit fixed fields in the forms. These names may contain letters, accented letters, and other characters, that may cause problems to your code depending on the encoding you use. They may look differently in uppercase and lowercase, or may not be case foldable at all. Searching and sorting these names may be tricky too. And if you design an application, web form, and/or database dealing with personal names, you'll have to take that into account."], "date": "July 2020", "tags": ["Diversity", "Internationalization", "Natural Language Processing", "The Answer to Life the Universe and Everything Else", "failures/mistakes"]},
{"title": ["Yet another package for multi-tenancy in Django"], "author": ["Lorenzo Peña"], "description": ["Django is a popular, solid web framework for perfectionists with deadlines, with a wide ecosystem of packages that extend its powers in multiple directions. In the era of peaking popularity of Node/Deno, microservices, and heavyweight browser rendered webapps, Django still remains a triumphant monolith maker, very capable of major undertakings in the web arena."], "date": "July 2020", "tags": ["Abstractions", "Architecture", "Databases", "Django", "Django Projects"]},
{"title": ["Writing Zenlike Python"], "author": ["Jason McDonald"], "description": ["There's a profound gap between working code and Pythonic code. To the developer whose first language is NOT Python, the distinction can appear blurry, even arbitrary. What is this \"one obvious way\" all those Python nerds are going on about?"], "date": "July 2020", "tags": ["Beginners", "Clean Code", "Python 3", "Python general", "The Answer to Life the Universe and Everything Else"]},
{"title": ["Writing Good Python"], "author": ["Prashant Chaubey"], "description": ["Like other programming languages, it is easy to write cryptic, unmaintainable, and rigid Python code. Moreover, in teams, this problem escalates due to varied coding styles of developers. How to ensure code quality and consistency? My goal with this talk is to educate my audience about some tools and libraries that can help us in making our code more consistent. ", "I was a Software Engineer who wrote Automation systems in Python for some of the fortune 500s. I intend to cover the following major ideas:", "•\tWhat is a high-quality code? How consistency is an important aspect of maintainability?", "•\tWays to achieve consistency in Python", "\to\tWhat is PEP8?", "\to\t“pylint” - a source code, bug, and quality checker for python \t\tand follows the style recommended by PEP 8", "\to\tWhat is PEP257? ", "\to\t“pydocstyle” checks compliance with Python docstring conventions.", "\to\tWhat is PEP484? ", "\to\t“mypy” provides optional static type checking.", "\to\t“bandit” which can find common security issues in Python code.", "\to\t“black” which is a Python source code formatter.", "•\tWays to integrate mentioned tools in development life cycle ", "\to\tWhile writing (IDE extensions)", "\to\tDuring commit (pre-commit hooks)", "\to\tAfter push (Build pipelines)", "•\t“pre-commit” is a framework for managing and maintaining multi-language pre-commit hooks", "•\tExample of an Azure DevOps pipeline integrating all mentioned tools.", "pylint, pydocstyle, mypy, bandit, black and pre-commit are available on PyPI. My audience should know how to install Python libraries from PyPi using pip."], "date": "July 2020", "tags": ["Best Practice", "Code Analysis", "Documentation", "Static Analysis", "Type-Hinting"]},
{"title": ["Why Transformers Work"], "author": ["Vincent D. Warmerdam"], "description": ["This will be a technical talk where I'll explain the inner workings of the machine learning algorithms inside of Rasa. In particular I'll talk about why the transformer has become a part in many of our algorithms and has replaced RNNs. These include use-cases in natural language processing but also in dialogue handling. "], "date": "July 2020", "tags": ["Algorithms", "Deep Learning", "Natural Language Processing"]},
{"title": ["Writing and Scaling Collaborative Data Pipelines with Kedro"], "author": ["Tam-Sanh Nguyen"], "description": ["The goal of this talk is to introduce data pipeline developers to QuantumBlack's approach for keeping data pipelines healthy and sustainable and facilitating collaboration between data scientists and data engineers by using our open source framework, Kedro. Attendees need between novice and intermediate knowledge of Python (enough to understand syntactic sugar and funargs) in order to appreciate this talk."], "date": "July 2020", "tags": ["Best Practice", "Data", "Development", "Open-Source", "python"]},
{"title": ["Writing Clean Abstractions"], "author": ["Smit Thakkar"], "description": ["Abstractions make things appear simple. This is one of the main concepts behind OOP. So what is it?! This talk will provide some guidelines on how to build abstractions that are extendable and scalable. "], "date": "July 2020", "tags": ["Clean Code"]},
{"title": ["We have nearly one million lines of Python 2 code in production – and now?"], "author": ["Michael Howitz"], "description": ["In this talk I am going to present possible approaches for a Python 3 migration of existing Python code running on Python 2.7. I'll evaluate which of these approaches seems suitable for a large code base and which principles should be paid attention to to increase the probability of a successful migration project."], "date": "July 2020", "tags": ["Best Practice", "Development", "Python 2", "Python 3", "legacy-code"]},
{"title": ["Top 15 Python Tips for Data Cleaning/ Understanding"], "author": ["Hui Xiang Chua"], "description": ["Data cleaning is one of the most important tasks in data science but it is unglamorous, underappreciated and under-discussed. These are some common tasks involved in data cleaning but not limited to: ", "-\tMerging/ appending", "-\tChecking completeness of data", "-\tChecking of valid values", "-\tDe-duplication", "-\tHandling of missing values", "-\tRecoding"], "date": "July 2020", "tags": ["Beginners", "Data", "Data Science", "Scientific Libraries (Numpy/Pandas/SciKit/...)", "Use Case"]},
{"title": ["Train. Serve. Deploy! Story of a NLP Model ft. PyTorch, Docker, Uwsgi and Nginx"], "author": ["Shreya Khurana"], "description": ["Natural language processing has seen leaps of technology progress with Machine Learning becoming the norm of solving the major problems in this area, with Machine translation being one of the major problems in this area. Neural machine translation systems are now used to convert sentences or phrases from one language to another, or in general, for sequence to sequence modeling. In this talk, we’ll be covering the steps from scratch to preprocess, train and serve a NMT model using PyTorch. While building a highly accurate model is a prerequisite to getting good quality translations, often in industry, we also need to make sure we can serve the model to customers without getting timeouts or delays. The practice of serving models requires creating a web app to get client requests and process them in a way the model would understand. For this, we’ll use  the various components of the application server environment - Flask, Docker, uwsgi and nginx. This talk is suitable for audience who is working in general with ML models and want to learn how to serve them or working specifically with NMT and want to learn about some quick prototyping tips. "], "date": "July 2020", "tags": ["Data Science", "Deep Learning", "Machine-Learning", "Natural Language Processing", "Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["Tools for maintaining an open source Python project"], "author": ["Ben Nuttall"], "description": ["There is a wealth of amazing tools freely available to open source software developers to use to maintain their projects. Practically every problem we face or are likely to face in software development has been lived through and solved many times over. Patterns emerge for dealing with development practises and we build our software using the tools made by the previous generation of developers."], "date": "July 2020", "tags": ["Community", "Documentation", "Git", "Open-Source", "Test Libraries (pytest/nose/...)"]},
{"title": ["Tooling for Static Analysis of Python Programs"], "author": ["Serge Sans Paille"], "description": ["In spite of the dynamic nature of their favorite language, some Python developer have a huge desire to statically analyse it. This can indeed be useful for linters, type inference, auto-completion and all the tooling some developers expect from modern IDE.", "We all know that lazy binding prevents even the simplest function call or attribute lookup to be reliably analyzed. Yet we try. And Python as this fabulous ``ast`` module, saving us from writing a parser! Isn't that a strong incentive to do static analysis?"], "date": "July 2020", "tags": ["Compiler and Interpreters"]},
{"title": ["The Python Data Visualization Landscape in 2020"], "author": ["Bence Arató"], "description": ["Python offers many different data visualization libraries, and the sheer number of alternatives  can be daunting to newcomers."], "date": "July 2020", "tags": ["Analytics", "Data", "Data Science", "Visualization"]},
{"title": ["There’s a Snake in the Birdhouse!"], "author": ["Mason Egger"], "description": ["It’s no surprise why many of us are so enamored with Python. Its simplicity, accessibility, and community make it a prime choice for many projects. However, not all software engineering shops use Python, maybe even some of the jobs you work at. Introducing Python to your company and building a Pythonic culture from the ground up is no small task, but it can be done. Join me as I take you through the journey of getting Python from zero to hero within my previous company. I’ll share the experience from start to finish, including what worked, what didn’t, what I would have done differently, and how I evangelized Python to bring it to be a supported language within my company’s ecosystem. Viewers will leave having learned from my experiences—both successes and mistakes—and with a solid plan for implementing Python at their job."], "date": "July 2020", "tags": ["Business", "Business Cases", "The Answer to Life the Universe and Everything Else", "Use Case", "failures/mistakes"]},
{"title": ["The Painless Route in Python to Fast and Scalable Machine Learning"], "author": ["Victoriya Fedotova", "Frank Schlimbach"], "description": ["Python is the lingua franca for data analytics and machine learning. Its superior productivity makes it the preferred tool for prototyping. However, traditional Python packages are not necessarily designed to provide high performance and scalability for large datasets.", "From this talk you will learn how to get close-to-native performance with Intel-optimized packages, such as numpy, scipy, and scikit-learn. The next part of the talk is focused on getting high performance and scalability from multi-cores on a single machine to large clusters of workstations. It will be demonstrated that with Python it is possible to achieve the same performance and scalability as with hand-tuned C++/MPI code:", "-\tScalable Dataframe Compiler (SDC) makes possible to efficiently load and process huge datasets using pandas/Python.", "-\tA convenient Python API to data analytics and machine learning primitives (daal4py). While its interface is scikit-learn-like, its MPI-based engine allows to scale machine learning algorithms to bare-metal cluster performance.", "-\tFrom the talk you will learn how to use SDC and daal4py together to build an end-to-end analytics pipeline that scales to clusters, requiring only minimal code changes."], "date": "July 2020", "tags": ["Analytics", "Big Data", "Distributed Systems", "Machine-Learning", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["The Joy of Creating Art with Code."], "author": ["Neeraj Pandey"], "description": ["Art is everywhere and it’s beautiful. Unleash the creative artist inside you with the beauty of Generative Art. Learn how algorithms are used to create these aesthetic art forms, how motion and structures emit sounds and what toolkits are required to do so. This talk looks at Python as an artistic and visual programming language with the simplicity and beauty of generative art using Processing, PyCairo and webGL. The audience will see an evolution of generative art over the last 50 years, how autonomously these art forms are created using algorithms and how we can stimulate paints and other media. The talk will be showing how to create artworks inspired by geometric and mathematical patterns which also includes randomness with hands-on examples (Two such examples are added here: ", " )."], "date": "July 2020", "tags": ["Algorithms", "Analytics", "JavaScript", "Physics", "Python 3"]},
{"title": ["The joy of deleting code"], "author": ["Radosław Ganczarek"], "description": ["They say measuring code quality by its LOC is like measuring aircraft quality by its weight. There's a lot of sense in the metaphor, as we often call inefficient code with words like \"heavy\" or \"bloated\".", "In my talk I'll tell you about my approach to deleting unneeded code, tools that could help you and how did it turned out in the end in real world projects.", "As you probably know, detecting unused code automatically is a hard task and doing it in Python is exceptionally hard because we sometimes call methods with getattr or write classes which are only used in non-python configuration files. Tools give us only a partial success. What you could do beyond them? What approach to take? I'd like to discuss it in detail in my talk."], "date": "July 2020", "tags": ["Architecture", "Best Practice", "Clean Code", "Code Analysis", "Programming"]},
{"title": ["The Hitchhiker's Guide to CLIs in Python"], "author": ["Vinayak Mehta"], "description": ["Command-line applications and interfaces are used by both newcomers and experienced Python developers everyday. But do you know how they came to be? Hop on to this ship as we go through the CLI galaxy and look at its history, explore the CLI anatomy and discover some Python packages that can help us create them."], "date": "July 2020", "tags": ["Command-Line", "Development", "Python general", "The Answer to Life the Universe and Everything Else", "Tooling"]},
{"title": ["Tests that (Almost) Write Themselves"], "author": ["Stefan Baerisch"], "description": ["What do we do when the only test requirements we have are \"the new system should have the exact same results as the old system\"? Golden Master Testing may help.", "The idea behind golden master testing, also called characterization testing, is quite simple: We don't write test cases that specify what the expected result is. Instead, we take the output from a prior, working version of a program (the golden master) and compare it to the result of the current version. If there is a difference between the output of the current system and the golden master, we may have found a bug."], "date": "July 2020", "tags": ["Best Practice", "Test Libraries (pytest/nose/...)", "Testing", "Tooling"]},
{"title": ["Telehealth Platform : Python & Django powered"], "author": ["Bhagvan Kommadi"], "description": ["We have built an AI-powered platform (python & django) for doctor's community and Telehealth support for patients during COVID-19 lockdown. The doctor's community interacts related to cases and triage for different patient cases. They can extend Telehealth support using medical practice management solutions. Patients can order medicines online through integrated pharmacies on the platform. AI Platform has digital, voice, and knowledge assistants to provide information to the doctor. Historical", "data is used for predictive analytics by the machine learning platform. The platform helps healthcare enterprises in the following:", "1. Deploy voice tech to facilitate clinical documentation", "2. Reduce physician's administrative burden", "3. Increase patient volume and billable revenue", "4. Eliminate transcription costs", "5. Voice to increase touchpoints and increase patient engagement"], "date": "July 2020", "tags": ["Algorithms", "Deep Learning", "Django", "HTML5", "Python 3"]},
{"title": ["Supercharge your Data Science workflow with Notebooks, VS Code, and Azure"], "author": ["Jeffrey Mew"], "description": ["Jupyter Notebooks and interactive programming have become one of the most popular tools for developing Python due to its flexibility and ease of use. Visual Studio Code now offers a first class Notebooks experience along with many great features for Data Scientists and Python developers alike. Come see how you can explore, experiment and productionize machine learning models using the flexibility of Notebooks combined with the power and productivity of VS Code. Along the way we’ll also be connecting to several Azure services from within VS Code, including Azure Virtual Machines for running the training job, Azure Storage for storing the dataset and model, Azure Functions for deploying our model and endpoint, and Azure Web Service for running a web application for making predictions."], "date": "July 2020", "tags": ["Data Science", "Jupyter"]},
{"title": ["Static Typing in Python"], "author": ["Dustin Ingram"], "description": ["Python is well-known as a programming language without static types. This means that you don’t need to say what a given variable will hold, or whether your function will return a string or an integer (or sometimes one, and sometimes another!). This has historically made Python a very flexible and beginner-friendly language."], "date": "July 2020", "tags": ["Python 3", "Static Analysis", "Tooling", "Type-Hinting", "python"]},
{"title": ["The Hidden Power of the Python Runtime"], "author": ["Elizaveta Shashkova"], "description": ["Many people like Python for its simplicity and beauty. But every statement in Python, even the simple one, produces a lot of events during the program execution. These events are usually hidden from a user, so it helps developers to skip low-level implementation details and focus on bigger things."], "date": "July 2020", "tags": ["Debugging", "Development", "Python general", "Tooling"]},
{"title": ["SQL for Data Science: Using Analytical Function"], "author": ["Brendan Tierney"], "description": ["Most developers are familiar with SQL for accessing and retrieving data. Over the past few years the SQL language has developed significantly with many features available for analyzing data in a more efficient manner. This presentation will focus on some of the newer SQL analytical functions, what they do and what problems they can be used for. With efficient use of SQL analytical functions, means less data to process in our Python programmes, and with quicker results, means it is a win-win for us. Do More with Less by using SQL analytical functions."], "date": "July 2020", "tags": ["Analytics", "Data", "Databases"]},
{"title": ["Speed Up Your Data Processing"], "author": ["Chin Hwee Ong"], "description": ["In a data science project, one of the biggest bottlenecks (in terms of time) is the constant wait for the data processing code to finish executing. Slow code, as well as connectivity issues, affect every step of a typical data science workflow — be it for network I/O operations or computation-driven workloads. In this talk, I will be sharing about common bottlenecks in data processing within a typical data science workflow, and exploring the use of parallel and asynchronous programming using concurrent.futures module in Python to speed up your data processing pipelines so that you could focus more on getting value out of your data. Through real-life analogies, you will learn about:"], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Data", "Data Science", "Multi-Processing", "Multi-Threading"]},
{"title": ["Social distancing from your system’s dependencies: An API’s Story"], "author": ["Olga Matoula"], "description": ["Have you ever imagined life without your tests breaking due to an external dependency having changed? My team chased the dream. We used mocks, stubs, other dependency isolation techniques, and the result was … a lot of ugly tests."], "date": "July 2020", "tags": ["Clean Code", "System Architecture", "TDD", "Test Libraries (pytest/nose/...)", "Testing"]},
{"title": ["Speak Python with Devices"], "author": ["Petertc Chu"], "description": ["The talk will be a getting start guide on controlling hardware devices with Python. We know Python users are very keen on multitasking and always wish to know more about how it can be used in different tasks. This talk will help audiences exploring new Python skillset. Audiences may be inspired by this talk and apply it to many scenarios, e.g., IoT and infrastructure automation."], "date": "July 2020", "tags": ["CPython", "Hardware/IoT", "Other Hardware", "Unix", "python"]},
{"title": ["Sharing Reproducible Python Environments with Binder"], "author": ["Sarah Gibson"], "description": ["As reproducibility gains traction in the data science and research communities, the need to package code, data and the computational environment is growing."], "date": "July 2020", "tags": ["Best Practice", "Data Science", "Jupyter", "Open-Source", "Public Cloud (AWS/Google/...)"]},
{"title": ["So, You Want to Build an Anti-Virus Engine?"], "author": ["JunWei Song", "KunYu Chen"], "description": [], "date": "July 2020", "tags": ["Mobile", "Open-Source", "Security", "Static Analysis"]},
{"title": ["Serverless 2.0 with Cloudstate.io-stateful functions with Python"], "author": ["Sean Walsh"], "description": ["Serverless is revolutionary and will dominate the future of Cloud. Function-as-a-Service (FaaS) however—with its stateless and short-lived functions is only the first step. "], "date": "July 2020", "tags": ["Cross-Platform-Development", "Development", "Distributed Systems", "Public Cloud (AWS/Google/...)"]},
{"title": ["ScanAPI"], "author": ["Camila Maia"], "description": ["In the current IT scenario, the use of APIs is, without question, widely vast, popular, and significant. It seems at least prudent to ensure they are working properly, as expected. To guarantee the quality of the data that is being consumed or used. To ensure that communication between services is occurring as expected. To ensure the system does, in fact, what it should do."], "date": "July 2020", "tags": ["APIs", "Open-Source", "RESTful", "Test Libraries (pytest/nose/...)", "Testing"]},
{"title": ["Running Unit Test on Top of Serverless Service"], "author": ["Adinata Thayib"], "description": ["I will share on how to utilize serverless architecture for a less common scenario - unit testing.", "As part of the talk, we will also discuss different approaches to parallelizing unit test suite execution.", "Attendees will also learns on cost-benefit analysis related to increasing developer productivity."], "date": "July 2020", "tags": ["Case Study", "Multi-Processing", "Public Cloud (AWS/Google/...)", "Test Libraries (pytest/nose/...)", "Tooling"]},
{"title": ["Running EuroPython 2020 as an online conference"], "author": ["Marc-Andre Lemburg"], "description": ["We had been planning the EuroPython 2020 conference in Dublin, Ireland ever since late in 2019, when we ran the CFP. In March, it became apparent that the COVID-19 crisis would not be over by July 2020 and so we had to make a hard decision to either drop the event for 2020 or go online."], "date": "July 2020", "tags": ["Community", "EuroPython", "EuroPython Society (EPS)", "The Answer to Life the Universe and Everything Else"]},
{"title": ["Roadmap to an Open Source Artificial Pancreas & Diabetes monitoring with Flask"], "author": ["Diana Rodriguez Manrique"], "description": ["Open Source has crossed frontiers and is widely used to solve problems in the health & science fields. In this talk we’ll learn about the many moving parts of continuous glucose monitoring for type 1 Diabetes as part of the open-source artificial pancreas project and building a notifier for the most used OSS continuous glucose monitoring dashboard: Nightscout."], "date": "July 2020", "tags": ["Beginners", "Communication", "DIY", "Development", "Open-Source"]},
{"title": ["Real Time Stream Processing for Machine Learning at Massive Scale"], "author": ["Alejandro Saucedo"], "description": ["This talk will provide a practical insight on how to build scalable data streaming machine learning pipelines to process large datasets in real time using Python and popular frameworks such as Kafka, SpaCy and Seldon."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Best Practice", "Big Data", "Distributed Systems", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Ray: A System for High-performance, Distributed Python Applications"], "author": ["Dean Wampler"], "description": ["Ray (", ") is an open-source, distributed framework from U.C. Berkeley’s RISELab that easily scales Python applications from a laptop to a cluster. While broadly applicable, it was developed to solve the unique performance challenges of ML/AI systems, such as the heterogeneous task scheduling and state management required for hyperparameter tuning and model training, running simulations when training reinforcement learning (RL) models, and model serving. Ray is now used in many production deployments. "], "date": "July 2020", "tags": ["Architecture", "Data", "Deep Learning", "Distributed Systems", "Microservices"]},
{"title": ["Python Table Manners: Cut the Cookie Gracefully"], "author": ["Wei Lee"], "description": ["### Goals", "I expect the audiences to gain knowledge of the tools I mention and the primary usage of them. The tools will cover various aspects of software engineering (e.g., dependencies, testing, security, etc.). Also, I'll purpose how I combine all these tools in my development workflow as a sample for how the audiences can integrate these tools into their workflow."], "date": "July 2020", "tags": ["Best Practice", "General", "Programming", "Tooling"]},
{"title": ["Python Memory Management 101"], "author": ["J.M. Ortega"], "description": ["I will review the main mechanims for memory allocation and how the garbage collector works in conjunction with the memory manager for reference counting of the python objects.Finally, I will comment the best practices for memory managment such as writing efficient code."], "date": "July 2020", "tags": ["Best Practice", "Development", "Management", "Python Skills"]},
{"title": ["Python Emergency Remote Teaching"], "author": ["Fernando Masanori Ashikaga"], "description": ["During the pandemic lockdown of COVID-19, we found a very different context from the usual: a) students with much more time available for learning b) many students who did not have a personal computer and could only access classes by cell phone c) difficulty to realistically assess learning. In this lecture we will present the real experiences in a traditional programming course given during the Covid-19 pandemic."], "date": "July 2020", "tags": ["Beginners", "Case Study", "Community", "Education"]},
{"title": ["pyRT - Computer Graphics in Jupyter Notebooks for Fun and Teaching"], "author": ["Martin Christen"], "description": ["PyRT (pronounced pirate) is a raytracer/image generator for Python 3.5 and higher. This project is mainly done with the following in mind:"], "date": "July 2020", "tags": ["3D", "Education", "GEO and GIS", "Teaching", "Virtualization"]},
{"title": ["Probabilistic Forecasting with DeepAR and AWS SageMaker"], "author": ["Nicolas Kuhaupt"], "description": ["In time series forecasting we are interested in how the time series is going to continue in the future. This is of high importance in areas like forecasting energy production from renewable resources, forecasting demand of customers or the price of products. Many forecasting algorithms provide only the prediction. However, oftentimes we are also interested in the likelihood of the prediction and how much it may vary. This is what probabilistic forecasting is for. With every forecast, we also obtain an upper and lower bound with certain probabilities. For a long time, probabilistic forecasting was limited to traditional techniques like ARIMA. DeepAR is an algorithm that allows us to combine Deep Learning techniques with probabilistic forecasting. Additionally, in contrast to training a model for each time series individually, DeepAR suggests training one large forecasting model for all related time series. The algorithm was developed by Amazon and is also provided in AWS SageMaker. ", "In this talk, we will understand the theoretical basics of DeepAR, have a look at a practical time series example and will demonstrate an implementation. In the end, you will be prepared to get started with your own forecasts."], "date": "July 2020", "tags": ["Data Science", "Deep Learning", "Machine-Learning", "Predictions", "Public Cloud (AWS/Google/...)"]},
{"title": ["Practical Optimisations for Pandas"], "author": ["Eyal Trabelsi"], "description": ["Writing performant pandas code is not an easy task, in this talk I will explain how to find the bottlenecks and how to write proper code with computational efficiency, and memory optimisation in mind."], "date": "July 2020", "tags": ["Best Practice", "Data", "Data Science"]},
{"title": ["Pluggable Architecture"], "author": ["Aly Sivji"], "description": ["Applications and libraries with a pluggable architecture allow developers to add custom functionality. Plugins can customize user interfaces, create new workflows, and interface with legacy systems. Designing a plugin is often difficult - documentation is sparse, outdated, or non-existent. You end up diving into a unfamiliar codebase to figure out what to do."], "date": "July 2020", "tags": ["Abstractions", "Architecture", "Development", "Software Design", "System Architecture"]},
{"title": ["Painting with GANs: Challenges and Technicalities of Neural Style Transfer"], "author": ["Anmol Krishan Sachdeva"], "description": ["A lot of advancements are happening in the field of Deep Learning and Generative Adversarial Networks are one of them. We have seen GANs being applied for photo editing and in-painting, generating new image datasets and realistic photographs, increasing resolution of images (Super Resolution), and many more things. Some people have also exploited GANs for generating fake content. All the above-mentioned examples are result of a technique where the focus is to generate uncommon yet original samples from scratch. However, these examples have very less commercial applications and GANs are capable of doing much more. The focus of this talk is a technique called \"Neural Style Transfer (NST)\" which has numerous commercial applications in the gaming world, fashion/design industry, mobile applications, and many more fields. Challenges and technicalities of NSTs will be covered in great detail. We will teach the machines on how to paint images and utilize Style Transfer networks to generate artistic artefacts."], "date": "July 2020", "tags": ["Computer Vision", "Deep Learning", "Generative Adversarial Networks", "Image Processing", "Machine-Learning"]},
{"title": ["Overcoming access control in web APIs"], "author": ["Adam Hopkins"], "description": ["Great, you've developed a great web API. Awesome, you are about to deploy it. But, how do you secure it and manage access?"], "date": "July 2020", "tags": ["APIs", "Authentication", "Best Practice", "RESTful", "Web"]},
{"title": ["Painless Machine Learning in Production"], "author": ["Chase Stevens"], "description": ["Developing machine learning models is easy; training, deploying, monitoring, scaling, and maintaining them in an automated fashion - all while maintaining your sanity - is hard. "], "date": "July 2020", "tags": ["Case Study", "Data Science", "DevOps general", "Infrastructure", "Machine-Learning"]},
{"title": ["Object Internals"], "author": ["Mridu Bhatnagar"], "description": ["This talk is intended to explain to participants what is happening under the hood when they are playing around with different python built-in data structures. Explain the concepts such that they are not surprised by the behavior of Python."], "date": "July 2020", "tags": ["Data-Structures", "Development", "Python 3"]},
{"title": ["NLPeasy - a Workflow to Analyse, Enrich, and Explore Textual Data"], "author": ["Philipp Thomann"], "description": ["Ever wanted to try out NLP methods but it felt it too cumbersome to set up a workflow for textual data? How to enrich your data based on textual features and explore the results?"], "date": "July 2020", "tags": ["Data Science", "Elastic Search", "Machine-Learning", "Natural Language Processing"]},
{"title": ["Migrating codebases with millions of modules from Python 2 to Python 3"], "author": ["Francisco Passos"], "description": ["This has been mitigated with tooling and education, but for the most part it requires human action and decision. While most codebases have somewhere between tens and thousands of Python modules, some companies may maintain a codebase with millions of modules. This presentation covers techniques and tooling that Google created to enable the developers to scope their migration needs, plan the work required, execute effectively at scale and collaborate across teams/dependencies."], "date": "July 2020", "tags": ["Best Practice", "Python 2", "Python 3"]},
{"title": ["Mastering a data pipeline with Python: 6 years of learned lessons from mistakes"], "author": ["Robson Junior"], "description": ["Building data pipelines are a consolidated task, there are a vast number of tools that automate and help developers to create data pipelines with few clicks on the cloud. It might solve non-complex or well-defined standard problems. This presentation is a demystification of years of experience and painful mistakes using Python as a core to create reliable data pipelines and manage insanely amount of valuable data. Let's cover how each piece fits into this puzzle: data acquisition, ingestion, transformation, storage, workflow management and serving. Also, we'll walk through best practices and possible issues. We'll cover PySpark vs Dask and Pandas, Airflow, and Apache Arrow as a new approach."], "date": "July 2020", "tags": ["Beginners", "Big Data", "Case Study", "Data Science", "Open-Source"]},
{"title": ["Making Pandas Fly"], "author": ["Ian Ozsvald"], "description": ["Larger datasets can't fit into RAM - suddenly you can't use Pandas any more - but we need to analyse that data! First we'll review techniques to compress our data (maybe cutting our DataFrame RAM usage in half!) so we can process more rows using regular Pandas. Next we'll look at clever ways to make common operations run faster on DataFrames including dropping down to numpy, compiling with Numba and running multi-core. Finally for still-larger datasets we'll review Dask on Pandas and the new Vaex competitor solution. You'll leave with new techniques to make your DataFrames smaller and ideas for processing your data faster.", "This talk is inspired by Ian's work updating his O'Reilly book High Performance Python to the 2nd edition for 2020. With over 10 years of evolution the Pandas DataFrame library has gained a huge amount of functionality and it is used by millions of Pythonistas - but the most obvious way to solve a task isn't always the fastest or most RAM efficient. This talk will help any Pandas user (beginner or beyond) process more data faster, making them more effective at their jobs."], "date": "July 2020", "tags": ["Big Data", "Data Science", "Multi-Processing", "Performance", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Machine Learning for Everyone"], "author": ["Aaron Ma"], "description": ["Machine learning (ML) is becoming an essential technology for our day to day life. Stop taking ML as a threat and learn it today as not learning it is a HUGE LOSS! Get started today with ML in Aaron's remarkable 45-mins talk. We will begin by talking about the paradigm of ML, then taking a deep dive into Neural Networks and building a Neural Network from scratch with Keras and TensorFlow (the hottest machine learning framework). You'll master the magic of neural networks that are powering incredible advances both in AI, self-driving cars, and much more! Finally, we will finish off by talking about Reinforcement learning and how it is empowering YouTube suggestions along with tips-and-tricks from a specialist plus a grand finale mind-blowing demo. Ready to master the paradigm of ML? Let's get started."], "date": "July 2020", "tags": ["Beginners", "Deep Learning", "General", "Machine-Learning"]},
{"title": ["Live-coding a music synthesizer"], "author": ["Ram Rachum"], "description": ["This is going to be a fun live-coding session using NumPy and SoundDevice. The goal of this talk is to make the computer produce realistic-sounding instrument sounds, using nothing but math."], "date": "July 2020", "tags": ["Agile", "Algorithms", "Fun and Humor", "Physics", "PyPy"]},
{"title": ["Lessons from the Trenches: rewriting and re-releasing virtualenv"], "author": ["Bernat Gabor"], "description": ["virtualenv is a tool that builds virtual environments for Python. It was first created in September 2007 and lived most of its life being a single file project with an increasing amount of (scary) workarounds within. It managed to grow until it was 2,700 lines of code. Maintaining this project became increasingly more troublesome, to the point where, we had more than 500 open issues at one point. In July 2019, I started working from scratch on a rewrite, with the goal of not just increasing the project's maintainability, but also to make it faster and add some new features that were just impossible or too hard to do in the existing code base. Fast forward six months to January 2020, when we released the first beta, with the first full release coming out on 10th February. It took a bit more than a month to squash all the open bugs tickets, but April started without any remaining open bug tickets. This talk will cover the lessons I've learned while on this journey."], "date": "July 2020", "tags": ["Packaging", "Virtual Env", "python"]},
{"title": ["IPython: The Productivity Booster"], "author": ["Miki Tebeka"], "description": ["IPython seems like a fancy Python shell. Why do we need it when we have PyCharm, VSCode, and other IDEs?"], "date": "July 2020", "tags": ["Development", "Ipython"]},
{"title": ["IoTPy: Python + Streams + Agents for Streaming Applications"], "author": ["Kanianthra Chandy"], "description": ["Sensors, social media, news feeds, webcams and other sources generate streams of data which are analyzed to control actuators, generate alerts, and feed displays. These applications process streams on onboard computers, such as the Raspberry Pi, connected directly to sensors, and send summarized information to the cloud for further processing. These applications have two characteristics: (1) Concurrency: The applications are concurrent using multiple threads to connect to sensors and actuators, shared memory across multiple processes on multicore machines and message passing for distributed systems spanning multiple computers. (2) Data Analysis: The applications use programs from a variety of libraries including those for signal processing, machine learning and natural language processing."], "date": "July 2020", "tags": ["Distributed Systems", "Internet of Things (IoT)", "Messaging and Job Queues (RabbitMQ/Redis/...)", "Scientific Libraries (Numpy/Pandas/SciKit/...)", "Sensors"]},
{"title": ["Interactive Mapmaking with Python"], "author": ["Sangarshanan Veeraraghavan"], "description": ["GeoDataframes are awesome for working with GIS data in Python as it provides the goodness of pandas for geographic data but So let's use them to create some cool interactive maps  "], "date": "July 2020", "tags": ["GEO and GIS", "Open-Source", "Visualization"]},
{"title": ["HTTP/3 – Why should I care?"], "author": ["Miloslav Pojman"], "description": ["HTTP is the foundation of the current web, and HTTP/3 is the upcoming major version of it. The new version is built on top of the QUIC transport protocol, originally developed in Google."], "date": "July 2020", "tags": ["HTTP", "Internet", "Privacy", "Web", "Web Protocols"]},
{"title": ["How to write multi-paradigm code"], "author": ["Elias Mistler"], "description": ["Python is a powerful multi-paradigm language which combines elements of object-orientation and functional programming. Both concepts can be really powerful if used right. But what if you use them together? It can be pragmatic and very efficient, but things can also get messy really quickly."], "date": "July 2020", "tags": ["Abstractions", "Architecture", "Best Practice", "Clean Code", "Functional Programming"]},
{"title": ["How to Run a Corridor Track in a Remote Conference with Python"], "author": ["Nicholas Tollervey"], "description": ["One of the best aspects of any conference, and EuroPython in particular, is the corridor track. It's when you walk around the physical conference venue and bump into an old buddy, find yourself striking up a conversation with a friendly co-attendee in the coffee queue, or join a huddle of welcoming folks discussing something interesting. The corridor track is where the community comes alive."], "date": "July 2020", "tags": ["Conferences and Meet-Ups", "Fun and Humor", "Game-Development", "Python general"]},
{"title": ["How to sort anything"], "author": ["Reuven Lerner"], "description": ["Sorting is one of those things that we take for granted in Python. The built-in \"sorted\" function knows how to sort any iterable of objects that are themselves sortable."], "date": "July 2020", "tags": ["Data", "Development", "Functional Programming"]},
{"title": ["How to be Pythonic? Design a Query Language in Python"], "author": ["Cheuk Ho"], "description": ["Query language is an important part of a database system, it is how people manage their data and how they can make the data useful to them. Starting from the 70s, the world is full of relational databases and SQL was the way to make queries. However, SQL is valuable to an injection attack. Lots of efforts are being used to stop those attacks and it made workflow become less efficient."], "date": "July 2020", "tags": ["APIs", "Databases", "Graph Databases", "Open-Source", "Programming"]},
{"title": ["How to Avoid Becoming a 10x Engineer"], "author": ["Ivana Kellyerova"], "description": ["The internet has never failed at being, among other things, a giant treasure of unsolicited advice by random people on all sorts of things, programming being no exception. Wanna become a better coder? Learn to maximize your WPM (c). Never look at documentation because that's just embarrassing. And for crying out loud, change your screen background to black!"], "date": "July 2020", "tags": ["Best Practice", "Programming", "The Answer to Life the Universe and Everything Else"]},
{"title": ["Honey, There Is a Python in My Android Phone!"], "author": ["James Ing Wei Tang"], "description": ["This is a small code snippet that I have written in Python for the POC of getting the GPS coordinate from android phone:"], "date": "July 2020", "tags": ["Gadgets", "General", "Python 3"]},
{"title": ["Diffprivlib: Privacy-preserving machine learning with Scikit-learn"], "author": ["Naoise Holohan"], "description": ["Data privacy is having an ever-increasing impact on the way data is stored, processed, accessed and utilised, as the legal and ethical effects of data protection regulations take effect around the globe. Differential privacy, considered by many to be the strongest privacy guarantee currently available, gives robust, provable guarantees on protecting privacy, and allows tasks to be completed on data with guarantees on the privacy of individuals in that data. This naturally extends to machine learning, where training datasets can contain sensitive personal information, that are vulnerable to privacy attacks on trained models.", "By using differential privacy in the training process, a machine learning model can be trained to accurately represent the dataset at large, but without inadvertently revealing sensitive information about an individual. Diffprivlib is the first library of its kind to leverage the power of differential privacy with scikit-learn and numpy to give data scientists and researchers access to the tools to train accurate, portable models with robust, provable privacy guarantees built-in.", "In this talk, we will introduce attendees to the idea of differential privacy, why it is necessary in today's world, and how diffprivlib can be seamlessly integrated within existing scripts to protect your trained models from privacy vulnerabilities. Attendees will be expected to have a basic understanding of sklearn (i.e., how to initialise, fit and predict a model). No knowledge of data privacy or differential privacy will be assumed or required."], "date": "July 2020", "tags": ["Data Privacy", "Data Protection", "Machine-Learning", "Open-Source", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Difficulties of Python code development:packages,virtualenvs and package mangers"], "author": ["Michał Wodyński"], "description": ["In this presentation I will show different packages that are used in Python. I will point out differences and explain the prons and cons of using them during code development. ", "\tAfter that we will jump to the topic of virtualenvs and  popular tools that are used for managing them. I will explain what is purpose of the virtualenvs in Python and why we should use them.", "\tFinally we will focus on the most important topic without which development is not possible – package mangers. Package managers it is wide topic in Python world. There is many package mangers and  currently we have tools like pip, pipenv or poetry but it is not obvious which of them we should use in first place. Which of them are recommended to use? What are prons and cons of certain package mangers? Is there any other not well known packages mangers? How package mangers are packaging Python code? Which of the package mangers are good for data scientists? Is your package manger is resolving dependencies? ", "\tThis questions can appear especially when you are beginner and just to want start working with Python. Unfortunately form the beginning you must face the problem which of the package manger you should use. In this presentation I will answer all of this questions. I will list popular package mangers and some not known. I will show differences and which of them are best for which case. Also I will explain differences between packages that are used by different packages mangers. If you are interested in code development and package mangers or you are just confused which of them you should use this presentation is definitely for you. During this presentation I will answer all questions and I will wipe out all doubts about packages, package mangers and virtualenvs."], "date": "July 2020", "tags": ["Beginners", "Conda / conda forge", "Development", "Packaging", "Virtual Env"]},
{"title": ["Developing GraphQL API in Django using Graphene"], "author": ["Nisarg Shah"], "description": ["GraphQL technology has become popular nowadays. While developing REST APIs, there are many things that developers need to take into consideration. There are multiple endpoints and over-fetching is the main problem of REST. GraphQL offers a unique approach and architecture for developing APIs. How is that efficient?"], "date": "July 2020", "tags": ["APIs", "Databases", "Django", "PostgreSQL", "Python 3"]},
{"title": ["Deploy your Machine Learning Bots like a boss with CI/CD"], "author": ["William Arias"], "description": ["Context: Today is relatively easy to create and train a conversational agent using Machine Learning Techniques, fire it up and showcase it in your computer"], "date": "July 2020", "tags": ["Deep Learning", "Deployment/Continuous Integration and Delivery", "Ipython", "Machine-Learning", "Open-Source"]},
{"title": ["Detecting and Analyzing Solar Panels in Switzerland using Aerial Imagery"], "author": ["Adrian Meyer"], "description": ["A novel method for detecting solar panels and its geometry on aerial imagery is presented. Deep Learning with PyTorch is being used for segmentation. The goal is to know the exact locations, dimensions and potential of every solar installation in Switzerland. It is shown how we labelled the data and how we found a solution to distinguish different solar panel types."], "date": "July 2020", "tags": ["Deep Learning", "Machine-Learning"]},
{"title": ["Decade of PyCon JP: How we spread the Python community in Japan"], "author": ["Takanori Suzuki"], "description": ["- Overview", "  - The history of PyCon JP has been 10 years since 2010", "  - The conference itself has started up → expanded in scale → stabilized", "  - At the same time, we are working on spreading Python throughout Japan.", "  - And what to do in the future", "- History of PyCon JP", "  - The origin of PyCon JP was PyCon APAC 2010 in Singapore", "  - We have been holding PyCon JP every year since 2011", "    - Our first PyCon was PyCon mini JP in 2011", "    - We invited PyCon APAC from Singapore in 2013", "  - Participants are increasing steadily", "  - There is English tracks and Japanese talks", "- 2013: Association", "  - Purpose: We have established a legal entity to make it easier to manage money and contracts for PyCon JP event ", "  - I have been a director since 2013", "- 2014-1016: Chair od PyCon JP event", "  - I was the chair of PyCon JP event from 2014 to 2016", "  - Purpose: Open management", "  - I opened every staff meeting to make it easier for new staff to join", "  - We created an operation manual and made it reusable", "  - We regularly publish our activities on the blog to get interested in event management", "- 2015-: PyCon mini", "  - Small PyCons in the region were held in Sapporo and Hiroshima in 2015", "  - It has been held in various places such as Kumamoto and Osaka", "  - PyCon Kyushu is held all over Kyushu(Fukuoka -> Okinawa -> Kumamoto)", "  - We have been sharing operating know-how and supporting money and people", "  - We have also provided a subdomain of pycon.jp", "- 2016-: Python Boot Camp", "  - Objective: We visit all over Japan to teach Python → We connect with local people → We hope local communities to start up", "  - We teach an introduction to Python programming in half a day", "  - We hold 40 times in 3.5 years with 950 local participants", "  - We hold in cooperation with local staff and local teachig assistants", "  - Result: Some local communities have been created", "  - PyCon JP has more people coming from local area", "- 2019: Python Boot Camp Caravan, Regional Meetup", "  - Purpose: To strengthen the connection between local communities", "  - A regional meetup was held at PyCon JP 2019 with local community members", "  - About 30 people gathered from all over Japan for this event", "  - We had various discussions and shared ideas and worries", "  - We hold local meetups online", "  - We hold the first online meeting using Zoom, with 15 participants from all over Japan", "- Future", "  - We want to hold PyCon JP outside of Tokyo", "  - We want to conquer all prefectures at Python Boot Camp", "  - We want PyCon mini to be held all over Japan", "- Summary", "  - We have spread Python throughout Japan with various activities", "  - I think it's important to meet", "  - First we go to meet local people", "  - Reunion strengthens relationship"], "date": "July 2020", "tags": ["Community"]},
{"title": ["Deceptive Security using Python"], "author": ["Gajendra Deshpande"], "description": ["Imagine you are passing through an unknown street at midnight and you find that some anti-social elements are following you. To save yourself from them you start running and look for a safe place to hide. On the way, you will find a good person and requests him to help you. He hides you in his place to protect you. When these anti-social elements visit a good person’s place and enquire about you, the good person misguides them and redirects them to some other place in order to protect you. This is exactly how deception works. In this analogy, YOU are the resources to be protected, anti-social elements are the hackers who want to gain access to the resources, and a good person is a deception technique that protects the resources from hackers by making them fall in the trap."], "date": "July 2020", "tags": ["Beginners", "Machine-Learning", "Security", "python"]},
{"title": ["Cultivating a Culture of Creativity, Collaboration, and Captainship"], "author": ["Amber Vanderburg"], "description": ["In my work as a consultant, coach, and organizational leader- I work with amazing companies around the world, helping them craft and implement strategies to build high-performing teams."], "date": "July 2020", "tags": ["Agile", "Best Practice", "Business", "Community", "DevOps general"]},
{"title": ["Creating the Next Generations of Billionaires - Part 2"], "author": ["lil anonymous"], "description": ["Our generation of young people in school (aged 5-18) have noticed the connection between Computer pRogramming, Technology, Success and Billionaires. On mass they are clamouring to master the skill of Computer pRogramming. It  has been dubbed the ‘4th’ R’ (computer pRogramming) along with Reading, wRiting and aRithmetic. So, governments worldwide have launched initiatives to have it taught in schools from Kindergarten to all the way to high school."], "date": "July 2020", "tags": ["Education", "General", "Python 3", "Science", "Teaching"]},
{"title": ["Corona-Net"], "author": ["Ching Lam Choi"], "description": ["Identified in December 2019, the novel Coronavirus has infected 2.7 million worldwide, and claimed the lives of 0.2 million. Amidst this deadly pandemic, I started my open source project, Corona-Net, in the hopes of contributing to the global fight against the Coronavirus. Corona-Net is a 3-part project dedicated to the classification, binary segmentation and multi-class segmentation of COVID-19. I first leverage the EfficientNet model for COVID-19 diagnosis, then utilise and refine the U-Net architecture for both binary and 3-class (ground-glass, consolidation, pleural effusion) segmentation of COVID-19 symptoms, through inference on the COVID-19 CT segmentation (chest axial CT) dataset. Through Corona-Net, I aim to develop a reliable, visual-semantically balanced method for automatic COVID-19 diagnosis, as well as extend an invitation to all to collaborate and stand together against this pandemic. My PyTorch code is publicly available at ", "."], "date": "July 2020", "tags": ["Computer Vision", "Data Science", "Deep Learning", "Image Processing", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Community-oriented conference status during COVID-19"], "author": ["Noah Chen"], "description": ["due to COVID-19(Coronavirus disease 2019), we changed our life, social, and our community. most of us are engineer/organizer/designer/contributor with passion to communicate to everyone who has similar background. in COVID-19 disease, we are forced to reduce social event for keeping safe. in case from China/Korea/Malaysia.... we can see the number is decreasing and be controlled after each government announced new policy: Face masked, Social Distancing, Quarantine, and Isolation. it meant we can not go to some place to hangout like usual, of course we have a lot of SMS tools/platform/media to keep relationship with our love, but for community, we easily lost our passion. and now, I want to share some doing/status of communities in Asia or other region I knew during/after COVID-19."], "date": "July 2020", "tags": ["Communication", "Community", "EuroPython", "freelancing"]},
{"title": ["Creating an inclusive team culture in times of change"], "author": ["Yenny Cheung"], "description": ["What can we do as technical leaders to make sure everyone feels accepted and build a supportive team culture during the turbulent times? This talk shares concrete steps that we can take to lead by example, and navigate our team through crisis:"], "date": "July 2020", "tags": ["Communication", "Community", "Diversity", "Management"]},
{"title": ["Clean Architectures in Python"], "author": ["Leonardo Giordani"], "description": ["Architectural considerations are often overlooked by developers or completely delegated to a framework. We should start once again discussing how applications are structured, how components are connected and how to lower coupling between different parts of a system, to avoid creating software that cannot easily be maintained or changed."], "date": "July 2020", "tags": ["Abstractions", "Architecture", "Clean Code", "Development", "TDD"]},
{"title": ["Can we deploy yet?"], "author": ["Anastasiia Tymoshchuk"], "description": ["What happens when your features are done, your MVP is ready and you want to deploy your first production build? What do you do then? How do you make your first production build instead of re-using your development one? is your code ready to handle real user interactions?", "This talk will show a production ready checklist for your Python code; what to look for when creating a production-ready Docker image; what are the differences between development and production environments and builds.", "You will see how to deal with exceptions, logs, and metrics with real-world use cases."], "date": "July 2020", "tags": ["Architecture", "Best Practice", "Clean Code", "Development", "Documentation"]},
{"title": ["Building The Perfect Personalised Menu Using Python"], "author": ["Irene Iriarte"], "description": ["This talk will describe how Gousto, a leading recipe box service based in the UK, is using python to build a personalisation ecosystem. Our menu planning optimisation algorithm allows us to create the perfect mix of recipes, ensuring a variety of dish types, cuisines and ingredients. Our recommendation engine sitting on top of this can then offer each customer a personally curated menu, making sure that users have meaningful choice. All this while ensuring that we are also optimising for maximum performance from the operations point of view! "], "date": "July 2020", "tags": ["Algorithms", "Case Study", "Data Science", "E-Commerce", "Machine-Learning"]},
{"title": ["Building smarter solutions with no expertise in machine learning"], "author": ["Laurent PICARD"], "description": ["ML? API? AutoML? Python is the language of choice to solve problems with machine learning, but what can we build in only a few hours or days and without any expertise? In this session, we'll see how to benefit from existing ML models and how to create a custom model with AutoML techniques. We’ll also be active players of a live demo, so don't put your smartphone on airplane mode!"], "date": "July 2020", "tags": ["Computer Vision", "Human-Machine-Interaction", "Machine-Learning", "Natural Language Processing", "Public Cloud (AWS/Google/...)"]},
{"title": ["Building reproducible distributed applications at scale"], "author": ["Fabian Höring"], "description": ["Packaging in Python is hard. Packaging is particularly hard when code needs to run in a distributed computing environment where it is difficult to know what runs where and which parts of the code are available to run there. "], "date": "July 2020", "tags": ["Big Data", "Distributed Systems", "Packaging", "Virtual Env"]},
{"title": ["Building quantum applications with D-Wave's Leap"], "author": ["Alexander Condello"], "description": ["In the past, quantum computing was largely reserved for researchers, physicists, and scientists with direct access to physical quantum computing systems. But the game has changed, thanks to the cloud. Barriers to quantum computing are coming down quickly."], "date": "July 2020", "tags": ["Community", "Jupyter", "Machine-Learning", "Other Hardware", "Python general"]},
{"title": ["Bringing your Python script to more users!"], "author": ["Takuya Futatsugi"], "description": ["It is wonderful to automate boring stuffs with Python.", "In Japan, new introductory books are being published every month and more and more Pythonistas are working on automation.", "A Python script that is useful to you may be useful to others.", "So I talk about how to enable others to use your script."], "date": "July 2020", "tags": ["Beginners", "Command-Line", "Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["Boosting simulation performance with Python"], "author": ["Eran Friedman"], "description": ["Our product uses a fleet of real (not virtual) robots to perform different tasks in a fulfillment warehouse. Simulation is an essential tool in this kind of product: it allows to perform regression tests and test new features without the need for real and expensive hardware, to compare the impact of different algorithms and optimizations, to inject failures, and more."], "date": "July 2020", "tags": ["Architecture", "Robotics", "Testing"]},
{"title": ["Best practices for production-ready Docker packaging"], "author": ["Itamar Turner-Trauring"], "description": ["You know the basics of packaging your Python application for Docker, but do you know enough to run that image in production? Bad packaging can result in security and production problems, not to mention wasted time try to debug unreproducible errors."], "date": "July 2020", "tags": ["Deployment/Continuous Integration and Delivery", "DevOps general", "Docker", "Packaging", "Security"]},
{"title": ["Automating machine learning workflow with DVC"], "author": ["Hongjoo Lee"], "description": ["As software engineers work on CI/CD process as soon as they start a new project, data scientists and ML engineers define a pipeline for data as it flows through a typical workflow. Each step of the pipeline is fed data processed from its preceding step as CI/CD process starts from code changes. "], "date": "July 2020", "tags": ["Big Data", "Data", "Data Science", "Deployment/Continuous Integration and Delivery"]},
{"title": ["Automate your tasks with Python and publish with Chat Apps"], "author": ["Anton Chernikov"], "description": ["The technology is to take script written in a high-level language (Python), analyze its inputs/outputs, images or graphs display, other interactions with the user and build connectors to this script from Chat Apps like Slack, Skype, and others. Imagine that you described your skill as a script and gave it to a software robot. And from that moment it is his skill, you and your colleagues can ask him any time to run this skill and give results. As a script author, you don't think about how to connect with different Chat Apps, how to control access, how to monitor that script works fine when colleagues run it, how to save logs, how to balance load if there are too many colleagues running script and so on, our platform does all of this so the author doesn't need to think about what is that software robot, how it works, the platform will understand script by itself. The author just drop script to the platform and tell to the platform which colleagues have the right to run this script."], "date": "July 2020", "tags": ["Best Practice", "Community", "Operations", "Workforce", "python"]},
{"title": ["Attractive GUIs with PySimpleGUI"], "author": ["Ruud van der Ham"], "description": ["In the Python landscape, there are several high-end GUI packages. Of course, there’s tkinter which is part of the standard library. And there is wxPython and several versions of Qt. What they share is that they are very flexible but not only have a steep learning curve but also take considerable development effort to realize even a simple user interface.", "At the other of the spectrum, there are several design tools that either generate code of a layout structure. In many cases, the functionality is rather limited, though.", "Relatively recent, an independent open-source developer (not me) has made a product that tries to bridge the gap between these two worlds: PySimpleGUI. This package runs on top of tkinter, QT for Windows, wxPython and Remi.", "In this talk, I want to show the design methodology behind this fascinating product that might change the way people look at GUIs.", "I will start with live coding a simple yet not evident program that shows the basic concepts. With this, I will demonstrate the design philosophy.", "PySimpleGUI can also be used to implement a user-friendly interface as opposed to command-line interfaces.", "From there, I will give an overview of some more elements present in this package.", "Finally, I will show a full-featured GUI program with several bells and whistles."], "date": "July 2020", "tags": ["Beginners", "General", "Human-Machine-Interaction", "python"]},
{"title": ["API-schema-based testing with schemathesis"], "author": ["Alexander Hultnér"], "description": ["The goal with this talk is to introduce the audience to property-based testing for API’s using schemas to automatically generate test scenarios, enabling them to write more powerful tests faster. "], "date": "July 2020", "tags": ["APIs", "RESTful", "Test Libraries (pytest/nose/...)", "Testing", "Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["Accessible Python education for schoolgirls using Avocados, Zombies, and Korean!"], "author": ["Chiin-Rui Tan"], "description": ["Imagine this school scenario: an entire year group of students aged 11-12, the majority completely new to coding, undergoing 6 hours of compulsory lessons on Python for Scientific Computing.    "], "date": "July 2020", "tags": ["Case Study", "Data Science", "Education", "Learning", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["An ASGI Server from scratch"], "author": ["Philip Jones"], "description": ["I intend for this to be a fairly advanced talk that shows the steps required to go from a TCP echo server to a basic HTTP/1 ASGI server using asyncio for the IO. This is aimed at people who've read about asyncio, coroutines, etc and want to see them used in practice."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Web", "Web Protocols", "Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["Advanced Infrastructure Management in Kubernetes using Python"], "author": ["Gautam Prajapati"], "description": ["Many of us are using Kubernetes in production. A Kubernetes Operator is a way to automate packaging, deploying, and managing of a Kubernetes Application. It is a software alternative to a human operator who has deep knowledge of how to set up, deploy, and manage a particular piece of infrastructure and what to do if it isn’t behaving correctly. Let’s see how we can automate all of this while staying in the Python ecosystem."], "date": "July 2020", "tags": ["DevOps general", "Distributed Systems", "Infrastructure", "Messaging and Job Queues (RabbitMQ/Redis/...)", "python"]},
{"title": ["A pythonic full-text search"], "author": ["Paolo Melchiorre"], "description": ["A full-text search on a website is the best way to make its contents easily accessible to users because it returns better results and is in fact used in online search engines or social networks."], "date": "July 2020", "tags": ["Django", "PostgreSQL", "Use Case", "Web"]},
{"title": ["A deep dive and comparison of Python drivers for Cassandra and Scylla"], "author": ["Alexys Jacob"], "description": ["This talk will explain the thread-per-core data architecture of Scylla and", "detail how we implemented \"shard-awareness\" in the Cassandra Python driver", "which allows to route queries down to the right CPU!"], "date": "July 2020", "tags": ["Databases", "NoSQL", "Python 3", "Scaling"]},
{"title": ["15 Things You Should Know About Spacy"], "author": ["Alexander Hendorf"], "description": ["spaCy is a free, open-source library for advanced Natural Language Processing (NLP) in Python.", "It was specifically designed for production use and it's a great tool to build applications that process text and help  to “understand” large corpuses. "], "date": "July 2020", "tags": ["Natural Language Processing", "Python 3"]},
{"title": ["A Brief History of Jupyter Notebooks"], "author": ["William Horton"], "description": ["The Jupyter Notebook: many Python users love it, many other Python users love to hate it. But where did it come from? How did we come to have a tool that combines code execution, visualization, Markdown, and more? In this talk, we will dive into the development of the Jupyter Notebook and the older ideas that it built upon. "], "date": "July 2020", "tags": ["Data Science", "Ipython", "Jupyter", "Open-Source", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Staying for the Community: Building Community in the face of Covid-19"], "author": ["Naomi Ceder"], "description": ["Python communities around the world, large and small are facing loss - from the loss of in person meetups and conferences to the loss of employment and even the potential loss of health and life. As communities we are all confronting uncertainty and unanswered questions. In this talk I would like to reflect on some of those questions. What are communities doing now to preserve a sense of community in the face of this crisis? What might we do and what options will we have for coming events? How can we build and foster community and still keep everyone safe? What challenges might we all face in the future? What sources of support can we find? What are our sources of optimism and hope?"], "date": "July 2020", "tags": ["Community", "Conferences and Meet-Ups"]},
{"title": ["Python in Prison: how open source can change a criminal justice system"], "author": ["Jessica McKellar"], "description": ["The United States has the highest incarceration rate in the world, with over 2.2 million people behind bars in our prisons, jails, juvenile facilities, and detention centers."], "date": "July 2020", "tags": ["Python 3", "Teaching"]},
{"title": ["Guido van Rossum Q&A"], "author": ["Guido van Rossum"], "description": ["Q&A session with Guido van Rossum, Creator of Python."], "date": "July 2020", "tags": ["Python general"]},
{"title": ["Meditations on First Deployment: A Practical Guide to Responsible Development"], "author": ["Alejandro Saucedo"], "description": ["As the impact of software increasingly reaches farther and wider, our professional responsibility as developers becomes more critical to society. The production systems we design, build and maintain often bring inherent adversities with complex technical, societal and even ethical challenges. The skillsets required to tackle these challenges require us to go beyond the algorithms, and require cross-functional collaboration that often goes beyond a single developer. In this talk we introduce intuitive and practical insights from a few of the core ethics themes in software including Privacy, Equity, Trust and Transparency. We cover their importance, the growing societal challenges, and how organisations such as The Institute for Ethical AI, The Linux Foundation, the Association for Computer Machinery, NumFocus, the IEEE and the Python Software Foundation are contributing to these critical themes through standards, policy advise and open source software initiatives. We finally will wrap up the talk with practical steps that any individual can take to get involved and contribute to some of these great open initiatives, and contribute to these critical ongoing discussions."], "date": "July 2020", "tags": ["Ethics", "Machine-Learning"]}
][
{"title": ["30 Golden Rules of Deep Learning Performance"], "author": ["Siddha Ganju"], "description": ["“Watching paint dry is faster than training my deep learning model.”", "“If only I had ten more GPUs, I could train my model in time.”", "“I want to run my model on a cheap smartphone, but it’s probably too heavy and slow.”"], "date": "July 2020", "tags": ["Deep Learning", "Machine-Learning"]},
{"title": ["Extending HTTP for fun and non-profit"], "author": ["Roberto Polli"], "description": ["Writing API guidelines is a best practice for standardizing APIs produced by thousands of service provider, but what happens when those rules are not backed by internet standards?"], "date": "July 2020", "tags": ["APIs", "Best Practice", "Case Study", "Community", "HTTP"]},
{"title": ["Flasync Await"], "author": ["David Bordeynik"], "description": ["Async is all the rage, mostly because it simplifies waiting for an operation that takes some time to finish. Python went all in on asyncio by changing the language to support it (async/await) iIn this microservices era where many of the applications we develop consume several 3rd party API services, async is the fast track to success. In this talk, I’ll demonstrate the benefits of going async for a web application, justify choosing Sanic over other web frameworks like aiohttp. I’ll do so by transforming a Flask backed application to a Sanic backed application. Finally, I’ll provide tips & tricks from my experience on measuring, monitoring and testing async code."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Abstractions", "Best Practice", "Web"]},
{"title": ["Find a new job - Sponsor Presentations"], "author": ["Marc-Andre Lemburg"], "description": ["Many of our sponsor are looking to hire more developers and EuroPython is the perfect place to reach out to many of them."], "date": "July 2020", "tags": ["Business", "Development", "Job Hunting", "Python Skills", "Workforce"]},
{"title": ["Everything You Know About MongoDB is Wrong!"], "author": ["Mark Smith"], "description": ["MongoDB is webscale, right? It's a JSON database, it's eventually consistent, and you use map-reduce to query it. Oh, and it's insecure."], "date": "July 2020", "tags": ["Big Data", "Data", "Databases", "Development", "MongoDB"]},
{"title": ["Extending Python with Rust"], "author": ["Mikhail Medvedev"], "description": ["Rust is a rising star of the programming language world. I'd like to discuss it from a Python developer perspective. Obviously, Rust is not a replacement for Python, but in case you're seeking better performance it may be a good idea to build an extension. This is safer and arguably easier to do in Rust than in C.", "In this talk we will take a look at existing crates that provide interface to Python and see how easy it is to use them.", "Then we go through the demo and see it in action.", "Run some benchmarks against pure Python and also Cython.", "Write a Dockerfile to build it all together.", "Discuss CI/CD for mixed Rust/Python projects."], "date": "July 2020", "tags": ["All Other Programming Languages", "Compiler and Interpreters", "Deployment/Continuous Integration and Delivery", "Docker", "Rust"]},
{"title": ["gRPC Python, C Extensions, and AsyncIO"], "author": ["Lidi Zheng", "Pau Freixes"], "description": ["Goal - Encourage Python developers to understand C extensions by sharing gRPC Python’s practice, and advocate the adoption of AsyncIO."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "CPython", "Cython", "Performance"]},
{"title": ["Growing a Python Community at an Enterprise Scale"], "author": ["Mario Corchero", "Marianna Polatoglou"], "description": ["The talk will showcase how the Python community started and took off in Bloomberg, and how it can serve as a model that can be used within other companies as well. This includes details on how Bloomberg's Python community got started and grew to the place that it is today, as well as tips from its leaders personal experiences."], "date": "July 2020", "tags": ["Community"]},
{"title": ["Honey, There Is a Python in My Android Phone!"], "author": ["James Ing Wei Tang"], "description": ["This is a small code snippet that I have written in Python for the POC of getting the GPS coordinate from android phone:"], "date": "July 2020", "tags": ["Gadgets", "General", "Python 3"]},
{"title": ["Full Stack Type Safety"], "author": ["Szymon Pyżalski"], "description": ["The introduction of PEP-484 gave us an option to enforce the internal type consistency of our Python applications. Our web projects, however, consist of multiple layers, with the Python app taking the role of an HTTP backend. What options do we have to ensure consistency across our stack?", "In this talk, we will see some technologies that we can employ to enforce the contract between the layers of our stack. Especially between the frontend and backend. We will demo, how this can be achieved with REST/Swagger and with GraphQL. As both the Graphene library and the open API support for django-rest-framework are both a work-in-progress, we would check, what is possible, and what is still lacking. We will also discuss various approaches to the design: backend first, auto-generating backend from the spec, and TDD, with their advantages and disadvantages.", "The topic would be discussed on a simple web application. We would try to play some realistic scenarios, where a careless developer breaks the contract to see how such a mistake can be spotted in the CI phase of the development cycle.", "Basic knowledge of Django and JavaScript is required to understand the talk. Some familiarity with TypeScript and ReactJS would also be helpful. However, I plan to explain the code to the listeners that didn’t have prior exposure to these technologies."], "date": "July 2020", "tags": ["APIs", "Django", "JavaScript", "Type-Hinting", "Web Protocols"]},
{"title": ["Ensuring data integrity with asynchronous programming in a cloud IoT core"], "author": ["Theofanis Petkos", "George Zisopoulos"], "description": ["Undoubtedly this will be the decade of low-cost and high-performance cloud IoT core development.", "All cloud IoT solutions will have to meet the same two fundamental requirements: Performance and Data Integrity. Having said that,  AsyncIO comes to mind.", "While researching similar topics on cloud IoT solutions, we noticed that the vast majority of such solutions primarily includes performance. In this discussion we would like to demonstrate how you can ensure that a low-cost, fast developed cloud IoT core can ensure that its data is not corrupted and is accurate  for the user.", "Technically speaking, it is very interesting to analyze how a bucket of async/await tasks can handle (consume or even produce) messages from or to message queues, interact with other (even non pythonic) modules inside the core, manage socket connections and many other functionalities that make Python3.6+ the heart of any IoT core. Note that it is equally important to check imported data with periodic tasks, acquire statistics from devices and sanitize database data in order to ensure data integrity.", "Our goal: Firstly, to encourage new developers to get involved with cloud IoT cores and use Python and AsyncIO as the heart of their core. Secondly, as new developers we would like to show our logic and our prefered python libraries and techniques in order to receive feedback from more experienced developers.", "We are a team of software engineers located in Athens, Greece working for a fast growing startup in San Francisco (", "). We have developed our own cloud IoT core for a vehicle fleet management SaaS."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Internet of Things (IoT)", "Python 3", "Software Design", "Use Case"]},
{"title": ["Elegant Exception Handling"], "author": ["Eyal Trabelsi"], "description": ["Error handling is hard. Regardless of the approach you take, it usually means littering your application with checks and validations that greatly reduce code readability. So how can we tackle exceptions?"], "date": "July 2020", "tags": ["Python Skills", "Python general", "python"]},
{"title": ["Django Clone From Scratch With Flask"], "author": ["Abdur-Rahmaan Janhangeer"], "description": ["With Python, when thinking of web frameworks, two that come into mind are Django and Flask. Instead of having to choose one of the two, this session shows how you can engineer Flask to achieve a simili-Django app. It's a dive into the internal components of Django and the idea behind. The session covers different Flask development patterns to finally finish with an app that's functionally similar to Django with some extra features in for free. It also lists some caveats identified with such a pattern. This session requires attendees to know Flask and having used Django for building at least one project. At the very least it assumes the knowledge of models, views, controller, templates and migrations. It discusses along the way the educational and pedagogical aspect of learning web frameworks and proposes a syllabus. It discusses the benefits of learning Flask and the necessity of learning the two as a Pythonista. Django is the go-to framework for web development and it's no surprise that most freelancing jobs require Django. Flask is appreciated for the flexibility it gives. The session also touches about how we can better promote Flask through education. The session finishes with the hurdles identified when getting started with web development in Python, pulled from personal teaching experience."], "date": "July 2020", "tags": ["Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["Effective Code Reviews"], "author": ["Vinicius Gubiani Ferreira"], "description": ["Does your company uses code review? In this talk I will demonstrate why it should start using them immediately, share the many benefits and situations we've gone through, besides good practices that should be used for effective code reviews, that add quality to the product/service that is being delivered."], "date": "July 2020", "tags": ["Agile", "Best Practice", "Clean Code", "Code Analysis", "Communication"]},
{"title": ["Docker and Python: making them play nicely and securely for Data Science and ML"], "author": ["Tania Allard"], "description": ["Docker has become a standard tool for developers around the world to deploy applications in a reproducible and robust manner. The existence of Docker and Docker compose have reduced the time needed to set up new software and implementing complex technology stacks for our applications. Now, six years after the initial release of Docker, we can say with confidence that containers and containers orchestration have become some of the defaults in the current technology stacks."], "date": "July 2020", "tags": ["Conda / conda forge", "Data Science", "Deep Learning", "Machine-Learning", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Django Testing on Steroid: pytest + Hypothesis"], "author": ["Bojan Miletic"], "description": ["The talk should hopefully provided value to all listeners, regardless of their knowledge level, but preferably you have some knowledge of pytest test parametrization"], "date": "July 2020", "tags": ["Django", "TDD", "Test Libraries (pytest/nose/...)", "Testing"]},
{"title": ["EuroPython 2021: Help us build the next edition!"], "author": ["Marc-Andre Lemburg"], "description": ["We need help with organizing and running EuroPython 2021."], "date": "July 2020", "tags": ["Community", "EuroPython", "EuroPython Society (EPS)"]},
{"title": ["Simulation of logistic systems in Python with salabim"], "author": ["Ruud van der Ham"], "description": ["Discrete event simulation is a very powerful technique in many fields, like transport, warehousing, hospitals, manufacturing and logistics.", "There are several commercial packages that provide high end GUIs to design a system and to animate the operations. These  packages are neary always close source and are very expensive (think USD 10-20 K per user). Often implementing complex algorithms is cumbersome.", "On the other end of the spectrum are open source packages that use existing program languages. Python is particularly interesting because of the vast number of (scientific) packages, like machine learning, statistics and databases.", "In te Python landscape there is SimPy, that is rather limited in functionality. In this poster I will present my discrete even simulation package called salabim. Salabim uses coroutines via generators and makes it very easy to model complex systems. The package offers advanced real time (2D) animation, monitoring and statistical sampling.", "I will show some applications and how a simple model is built up."], "date": "July 2020", "tags": ["Algorithms", "Engineering", "Robotics", "Use Case", "Visualization"]},
{"title": ["The Phantom of Radon"], "author": ["Francesca Tedeschi"], "description": ["This project contains an open source Python library for image reconstruction in Axial Computed Tomography (TAC), based on the analytical Radon transforms of some classes of phantoms. ", "The package is available on GitHub at the following address: ", ".", "The mathematical phantoms are fictitious images, composed of very simple geometric figures (ellipses, squares and rectangles) that, sampled with the Radon transform allows to build a fictitious signal, called (exact) sinogram.  Using a phantom gives the advantage to test the reconstruction algorithm on a zero-noise data so the error we get is only due to numerical inaccuracies in the algorithm itself. We want to calculate two reconstructed images from the approximated and exact sinograms, obtained applying the iradon function of the Python library scikit-image on both of them. We expect a smaller error on the exact reconstructed image. This turns to be true on continuous regions, but near the discontinuities of the phantom the Gibbs phenomenon prevents us to obtain the same enhancement."], "date": "July 2020", "tags": ["Education", "Image Processing", "Open-Source", "Science", "Teaching"]},
{"title": ["Reduce hardware costs in Internet of Things using Python"], "author": ["Vijay Sajjanar"], "description": ["I guide students in developing systems which are real world and need less hardware. This is possible in 2 steps. One,reduce collecting data which is already available online. Two, compute on cloud instead on the hardware."], "date": "July 2020", "tags": ["Beginners", "Case Study", "Data", "Internet of Things", "Web Crawling"]},
{"title": ["Radio Astronomy with Python"], "author": ["Priscila Gutierres"], "description": ["Looking at higher redshifts is equivalent to looking back in time: they improve the studies of cosmology, expanding our knowledge of the universe. It allows us to study various physical phenomena like the power spectrum of galaxies which describes the distribution of galaxies on a range of scales, galaxy clustering, and large scales, the detection of the Baryon Acoustic Oscillation feature. ", "As a result,  a significant amount of work has been done to increase the efficiency and accuracy of the process via new algorithms and optimization of existing ones.", "Astronomical datasets are undergoing a rapid growth in size and complexity as past, ongoing and future surveys produce massive multi-temporal and multi-wavelength datasets, with huge information to be extracted and analyzed.", "The alternative to a full spectroscopic survey is to obtain multi-color images of the sky and perform photometric redshift estimates for the galaxies we have available. ", "When dealing with this problem, there are two main approaches: model-driven data analysis (template fitting methods) and data-driven analysis, which can use machine learning methods.", "To solve this problem, we use data-driven analysis, more specifically GPz (which uses Gaussian processes)  and  ANNz2 (which mainly uses neural networks), both python software."], "date": "July 2020", "tags": ["Big Data", "Data", "Machine-Learning", "Physics"]},
{"title": ["Durable Functions: A More Durable Azure Function"], "author": ["Joseph Song"], "description": ["Serverless functions-as-a-service lets you run event-triggered code without having to explicitly provision or manage infrastructure. While they are powerful, they also have limitations. In this talk, we’ll discuss how Durable Functions can overcome the limitation by extending Azure Functions to let you write stateful functions in a serverless compute environment."], "date": "July 2020", "tags": ["Infrastructure", "serverless"]},
{"title": ["Developing a match-making algorithm between customers and Go-Jek products!"], "author": ["Gunjan Dewan"], "description": ["GoJek has millions of monthly active users in Indonesia across our 20+ products and services. A major problem we faced was targeting these customers with promos and vouchers that were relevant to them. We developed a generalized model that takes into account the transaction history of users and gives a ranked list of our services that they are most likely to use next. From here on, we are able to determine the vouchers that we can target these customers with.", "In this poster, I will be presenting our process while developing the model, the challenges we faced during the time, how we used PySpark to tackle these challenges and the impact it had on our conversion rates."], "date": "July 2020", "tags": ["Data", "Data Science", "Machine-Learning"]},
{"title": ["Design and Simulate your Control Systems with Python, Why Not?"], "author": ["Brilian Putra Amiruddin"], "description": ["Many electrical engineering or control systems engineering students did not know that we can simulate our designed control algorithm with Python language, which is free and open source. In many colleges, to simulate the control algorithm it tends to use a paid programming language, but in many cases, the colleges did not provide the license for the students, so the students cannot afford it and ironically at the end, the students went to do an illegal act (software piracy)."], "date": "July 2020", "tags": ["Algorithms", "Engineering", "Programming", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Yet another package for multi-tenancy in Django"], "author": ["Lorenzo Peña"], "description": ["Django is a popular, solid web framework for perfectionists with deadlines, with a wide ecosystem of packages that extend its powers in multiple directions. In the era of peaking popularity of Node/Deno, microservices, and heavyweight browser rendered webapps, Django still remains a triumphant monolith maker, very capable of major undertakings in the web arena."], "date": "July 2020", "tags": ["Abstractions", "Architecture", "Databases", "Django", "Django Projects"]},
{"title": ["Your Name Is Invalid!"], "author": ["Miroslav Šedivý"], "description": ["People have names. Most people do. People have first names and last names. Many people do. People have any sorts of names that often don't fit fixed fields in the forms. These names may contain letters, accented letters, and other characters, that may cause problems to your code depending on the encoding you use. They may look differently in uppercase and lowercase, or may not be case foldable at all. Searching and sorting these names may be tricky too. And if you design an application, web form, and/or database dealing with personal names, you'll have to take that into account."], "date": "July 2020", "tags": ["Diversity", "Internationalization", "Natural Language Processing", "The Answer to Life the Universe and Everything Else", "failures/mistakes"]},
{"title": ["Decision Science with Probabilistic Programming"], "author": ["Mattia Ferrini"], "description": ["Generative Models are the Swiss Army Knife for the Decision Scientist. Generative models allow the simulation of scenarios based on different business hypotheses (Bayesian priors). With Probabilistic Programming, decision makers can simulate the impact of business drivers in times of great uncertainty."], "date": "July 2020", "tags": ["Data Science", "Deep Learning", "Functional Programming", "Science"]},
{"title": ["Writing Zenlike Python"], "author": ["Jason McDonald"], "description": ["There's a profound gap between working code and Pythonic code. To the developer whose first language is NOT Python, the distinction can appear blurry, even arbitrary. What is this \"one obvious way\" all those Python nerds are going on about?"], "date": "July 2020", "tags": ["Beginners", "Clean Code", "Python 3", "Python general", "The Answer to Life the Universe and Everything Else"]},
{"title": ["Writing Good Python"], "author": ["Prashant Chaubey"], "description": ["Like other programming languages, it is easy to write cryptic, unmaintainable, and rigid Python code. Moreover, in teams, this problem escalates due to varied coding styles of developers. How to ensure code quality and consistency? My goal with this talk is to educate my audience about some tools and libraries that can help us in making our code more consistent. ", "I was a Software Engineer who wrote Automation systems in Python for some of the fortune 500s. I intend to cover the following major ideas:", "•\tWhat is a high-quality code? How consistency is an important aspect of maintainability?", "•\tWays to achieve consistency in Python", "\to\tWhat is PEP8?", "\to\t“pylint” - a source code, bug, and quality checker for python \t\tand follows the style recommended by PEP 8", "\to\tWhat is PEP257? ", "\to\t“pydocstyle” checks compliance with Python docstring conventions.", "\to\tWhat is PEP484? ", "\to\t“mypy” provides optional static type checking.", "\to\t“bandit” which can find common security issues in Python code.", "\to\t“black” which is a Python source code formatter.", "•\tWays to integrate mentioned tools in development life cycle ", "\to\tWhile writing (IDE extensions)", "\to\tDuring commit (pre-commit hooks)", "\to\tAfter push (Build pipelines)", "•\t“pre-commit” is a framework for managing and maintaining multi-language pre-commit hooks", "•\tExample of an Azure DevOps pipeline integrating all mentioned tools.", "pylint, pydocstyle, mypy, bandit, black and pre-commit are available on PyPI. My audience should know how to install Python libraries from PyPi using pip."], "date": "July 2020", "tags": ["Best Practice", "Code Analysis", "Documentation", "Static Analysis", "Type-Hinting"]},
{"title": ["Writing Clean Abstractions"], "author": ["Smit Thakkar"], "description": ["Abstractions make things appear simple. This is one of the main concepts behind OOP. So what is it?! This talk will provide some guidelines on how to build abstractions that are extendable and scalable. "], "date": "July 2020", "tags": ["Clean Code"]},
{"title": ["Writing and Scaling Collaborative Data Pipelines with Kedro"], "author": ["Tam-Sanh Nguyen"], "description": ["The goal of this talk is to introduce data pipeline developers to QuantumBlack's approach for keeping data pipelines healthy and sustainable and facilitating collaboration between data scientists and data engineers by using our open source framework, Kedro. Attendees need between novice and intermediate knowledge of Python (enough to understand syntactic sugar and funargs) in order to appreciate this talk."], "date": "July 2020", "tags": ["Best Practice", "Data", "Development", "Open-Source", "python"]},
{"title": ["Why Transformers Work"], "author": ["Vincent D. Warmerdam"], "description": ["This will be a technical talk where I'll explain the inner workings of the machine learning algorithms inside of Rasa. In particular I'll talk about why the transformer has become a part in many of our algorithms and has replaced RNNs. These include use-cases in natural language processing but also in dialogue handling. "], "date": "July 2020", "tags": ["Algorithms", "Deep Learning", "Natural Language Processing"]},
{"title": ["We have nearly one million lines of Python 2 code in production – and now?"], "author": ["Michael Howitz"], "description": ["In this talk I am going to present possible approaches for a Python 3 migration of existing Python code running on Python 2.7. I'll evaluate which of these approaches seems suitable for a large code base and which principles should be paid attention to to increase the probability of a successful migration project."], "date": "July 2020", "tags": ["Best Practice", "Development", "Python 2", "Python 3", "legacy-code"]},
{"title": ["Train. Serve. Deploy! Story of a NLP Model ft. PyTorch, Docker, Uwsgi and Nginx"], "author": ["Shreya Khurana"], "description": ["Natural language processing has seen leaps of technology progress with Machine Learning becoming the norm of solving the major problems in this area, with Machine translation being one of the major problems in this area. Neural machine translation systems are now used to convert sentences or phrases from one language to another, or in general, for sequence to sequence modeling. In this talk, we’ll be covering the steps from scratch to preprocess, train and serve a NMT model using PyTorch. While building a highly accurate model is a prerequisite to getting good quality translations, often in industry, we also need to make sure we can serve the model to customers without getting timeouts or delays. The practice of serving models requires creating a web app to get client requests and process them in a way the model would understand. For this, we’ll use  the various components of the application server environment - Flask, Docker, uwsgi and nginx. This talk is suitable for audience who is working in general with ML models and want to learn how to serve them or working specifically with NMT and want to learn about some quick prototyping tips. "], "date": "July 2020", "tags": ["Data Science", "Deep Learning", "Machine-Learning", "Natural Language Processing", "Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["Taking Part in the Greatest Experiment in History"], "author": ["lil anonymous"], "description": ["In the last few weeks, one of the largest and most exciting experiments in the history of mankind has taken place, with over  900 million children in over 190 countries being the recipients of online (virtual) education. "], "date": "July 2020", "tags": ["Education"]},
{"title": ["Resurrecting a django project in python 2.7 for 3.8"], "author": ["Griffith S Rees"], "description": ["Goals: "], "date": "July 2020", "tags": ["Django", "GEO and GIS", "Git", "Testing", "legacy-code"]},
{"title": ["Top 15 Python Tips for Data Cleaning/ Understanding"], "author": ["Hui Xiang Chua"], "description": ["Data cleaning is one of the most important tasks in data science but it is unglamorous, underappreciated and under-discussed. These are some common tasks involved in data cleaning but not limited to: ", "-\tMerging/ appending", "-\tChecking completeness of data", "-\tChecking of valid values", "-\tDe-duplication", "-\tHandling of missing values", "-\tRecoding"], "date": "July 2020", "tags": ["Beginners", "Data", "Data Science", "Scientific Libraries (Numpy/Pandas/SciKit/...)", "Use Case"]},
{"title": ["Tools for maintaining an open source Python project"], "author": ["Ben Nuttall"], "description": ["There is a wealth of amazing tools freely available to open source software developers to use to maintain their projects. Practically every problem we face or are likely to face in software development has been lived through and solved many times over. Patterns emerge for dealing with development practises and we build our software using the tools made by the previous generation of developers."], "date": "July 2020", "tags": ["Community", "Documentation", "Git", "Open-Source", "Test Libraries (pytest/nose/...)"]},
{"title": ["Tooling for Static Analysis of Python Programs"], "author": ["Serge Sans Paille"], "description": ["In spite of the dynamic nature of their favorite language, some Python developer have a huge desire to statically analyse it. This can indeed be useful for linters, type inference, auto-completion and all the tooling some developers expect from modern IDE.", "We all know that lazy binding prevents even the simplest function call or attribute lookup to be reliably analyzed. Yet we try. And Python as this fabulous ``ast`` module, saving us from writing a parser! Isn't that a strong incentive to do static analysis?"], "date": "July 2020", "tags": ["Compiler and Interpreters"]},
{"title": ["There’s a Snake in the Birdhouse!"], "author": ["Mason Egger"], "description": ["It’s no surprise why many of us are so enamored with Python. Its simplicity, accessibility, and community make it a prime choice for many projects. However, not all software engineering shops use Python, maybe even some of the jobs you work at. Introducing Python to your company and building a Pythonic culture from the ground up is no small task, but it can be done. Join me as I take you through the journey of getting Python from zero to hero within my previous company. I’ll share the experience from start to finish, including what worked, what didn’t, what I would have done differently, and how I evangelized Python to bring it to be a supported language within my company’s ecosystem. Viewers will leave having learned from my experiences—both successes and mistakes—and with a solid plan for implementing Python at their job."], "date": "July 2020", "tags": ["Business", "Business Cases", "The Answer to Life the Universe and Everything Else", "Use Case", "failures/mistakes"]},
{"title": ["The Python Data Visualization Landscape in 2020"], "author": ["Bence Arató"], "description": ["Python offers many different data visualization libraries, and the sheer number of alternatives  can be daunting to newcomers."], "date": "July 2020", "tags": ["Analytics", "Data", "Data Science", "Visualization"]},
{"title": ["The Painless Route in Python to Fast and Scalable Machine Learning"], "author": ["Victoriya Fedotova", "Frank Schlimbach"], "description": ["Python is the lingua franca for data analytics and machine learning. Its superior productivity makes it the preferred tool for prototyping. However, traditional Python packages are not necessarily designed to provide high performance and scalability for large datasets.", "From this talk you will learn how to get close-to-native performance with Intel-optimized packages, such as numpy, scipy, and scikit-learn. The next part of the talk is focused on getting high performance and scalability from multi-cores on a single machine to large clusters of workstations. It will be demonstrated that with Python it is possible to achieve the same performance and scalability as with hand-tuned C++/MPI code:", "-\tScalable Dataframe Compiler (SDC) makes possible to efficiently load and process huge datasets using pandas/Python.", "-\tA convenient Python API to data analytics and machine learning primitives (daal4py). While its interface is scikit-learn-like, its MPI-based engine allows to scale machine learning algorithms to bare-metal cluster performance.", "-\tFrom the talk you will learn how to use SDC and daal4py together to build an end-to-end analytics pipeline that scales to clusters, requiring only minimal code changes."], "date": "July 2020", "tags": ["Analytics", "Big Data", "Distributed Systems", "Machine-Learning", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["The joy of deleting code"], "author": ["Radosław Ganczarek"], "description": ["They say measuring code quality by its LOC is like measuring aircraft quality by its weight. There's a lot of sense in the metaphor, as we often call inefficient code with words like \"heavy\" or \"bloated\".", "In my talk I'll tell you about my approach to deleting unneeded code, tools that could help you and how did it turned out in the end in real world projects.", "As you probably know, detecting unused code automatically is a hard task and doing it in Python is exceptionally hard because we sometimes call methods with getattr or write classes which are only used in non-python configuration files. Tools give us only a partial success. What you could do beyond them? What approach to take? I'd like to discuss it in detail in my talk."], "date": "July 2020", "tags": ["Architecture", "Best Practice", "Clean Code", "Code Analysis", "Programming"]},
{"title": ["The Hitchhiker's Guide to CLIs in Python"], "author": ["Vinayak Mehta"], "description": ["Command-line applications and interfaces are used by both newcomers and experienced Python developers everyday. But do you know how they came to be? Hop on to this ship as we go through the CLI galaxy and look at its history, explore the CLI anatomy and discover some Python packages that can help us create them."], "date": "July 2020", "tags": ["Command-Line", "Development", "Python general", "The Answer to Life the Universe and Everything Else", "Tooling"]},
{"title": ["The Joy of Creating Art with Code."], "author": ["Neeraj Pandey"], "description": ["Art is everywhere and it’s beautiful. Unleash the creative artist inside you with the beauty of Generative Art. Learn how algorithms are used to create these aesthetic art forms, how motion and structures emit sounds and what toolkits are required to do so. This talk looks at Python as an artistic and visual programming language with the simplicity and beauty of generative art using Processing, PyCairo and webGL. The audience will see an evolution of generative art over the last 50 years, how autonomously these art forms are created using algorithms and how we can stimulate paints and other media. The talk will be showing how to create artworks inspired by geometric and mathematical patterns which also includes randomness with hands-on examples (Two such examples are added here: ", " )."], "date": "July 2020", "tags": ["Algorithms", "Analytics", "JavaScript", "Physics", "Python 3"]},
{"title": ["The Hidden Power of the Python Runtime"], "author": ["Elizaveta Shashkova"], "description": ["Many people like Python for its simplicity and beauty. But every statement in Python, even the simple one, produces a lot of events during the program execution. These events are usually hidden from a user, so it helps developers to skip low-level implementation details and focus on bigger things."], "date": "July 2020", "tags": ["Debugging", "Development", "Python general", "Tooling"]},
{"title": ["Telehealth Platform : Python & Django powered"], "author": ["Bhagvan Kommadi"], "description": ["We have built an AI-powered platform (python & django) for doctor's community and Telehealth support for patients during COVID-19 lockdown. The doctor's community interacts related to cases and triage for different patient cases. They can extend Telehealth support using medical practice management solutions. Patients can order medicines online through integrated pharmacies on the platform. AI Platform has digital, voice, and knowledge assistants to provide information to the doctor. Historical", "data is used for predictive analytics by the machine learning platform. The platform helps healthcare enterprises in the following:", "1. Deploy voice tech to facilitate clinical documentation", "2. Reduce physician's administrative burden", "3. Increase patient volume and billable revenue", "4. Eliminate transcription costs", "5. Voice to increase touchpoints and increase patient engagement"], "date": "July 2020", "tags": ["Algorithms", "Deep Learning", "Django", "HTML5", "Python 3"]},
{"title": ["Tests that (Almost) Write Themselves"], "author": ["Stefan Baerisch"], "description": ["What do we do when the only test requirements we have are \"the new system should have the exact same results as the old system\"? Golden Master Testing may help.", "The idea behind golden master testing, also called characterization testing, is quite simple: We don't write test cases that specify what the expected result is. Instead, we take the output from a prior, working version of a program (the golden master) and compare it to the result of the current version. If there is a difference between the output of the current system and the golden master, we may have found a bug."], "date": "July 2020", "tags": ["Best Practice", "Test Libraries (pytest/nose/...)", "Testing", "Tooling"]},
{"title": ["Supercharge your Data Science workflow with Notebooks, VS Code, and Azure"], "author": ["Jeffrey Mew"], "description": ["Jupyter Notebooks and interactive programming have become one of the most popular tools for developing Python due to its flexibility and ease of use. Visual Studio Code now offers a first class Notebooks experience along with many great features for Data Scientists and Python developers alike. Come see how you can explore, experiment and productionize machine learning models using the flexibility of Notebooks combined with the power and productivity of VS Code. Along the way we’ll also be connecting to several Azure services from within VS Code, including Azure Virtual Machines for running the training job, Azure Storage for storing the dataset and model, Azure Functions for deploying our model and endpoint, and Azure Web Service for running a web application for making predictions."], "date": "July 2020", "tags": ["Data Science", "Jupyter"]},
{"title": ["Static Typing in Python"], "author": ["Dustin Ingram"], "description": ["Python is well-known as a programming language without static types. This means that you don’t need to say what a given variable will hold, or whether your function will return a string or an integer (or sometimes one, and sometimes another!). This has historically made Python a very flexible and beginner-friendly language."], "date": "July 2020", "tags": ["Python 3", "Static Analysis", "Tooling", "Type-Hinting", "python"]},
{"title": ["SQL for Data Science: Using Analytical Function"], "author": ["Brendan Tierney"], "description": ["Most developers are familiar with SQL for accessing and retrieving data. Over the past few years the SQL language has developed significantly with many features available for analyzing data in a more efficient manner. This presentation will focus on some of the newer SQL analytical functions, what they do and what problems they can be used for. With efficient use of SQL analytical functions, means less data to process in our Python programmes, and with quicker results, means it is a win-win for us. Do More with Less by using SQL analytical functions."], "date": "July 2020", "tags": ["Analytics", "Data", "Databases"]},
{"title": ["Speak Python with Devices"], "author": ["Petertc Chu"], "description": ["The talk will be a getting start guide on controlling hardware devices with Python. We know Python users are very keen on multitasking and always wish to know more about how it can be used in different tasks. This talk will help audiences exploring new Python skillset. Audiences may be inspired by this talk and apply it to many scenarios, e.g., IoT and infrastructure automation."], "date": "July 2020", "tags": ["CPython", "Hardware/IoT", "Other Hardware", "Unix", "python"]},
{"title": ["Social distancing from your system’s dependencies: An API’s Story"], "author": ["Olga Matoula"], "description": ["Have you ever imagined life without your tests breaking due to an external dependency having changed? My team chased the dream. We used mocks, stubs, other dependency isolation techniques, and the result was … a lot of ugly tests."], "date": "July 2020", "tags": ["Clean Code", "System Architecture", "TDD", "Test Libraries (pytest/nose/...)", "Testing"]},
{"title": ["Speed Up Your Data Processing"], "author": ["Chin Hwee Ong"], "description": ["In a data science project, one of the biggest bottlenecks (in terms of time) is the constant wait for the data processing code to finish executing. Slow code, as well as connectivity issues, affect every step of a typical data science workflow — be it for network I/O operations or computation-driven workloads. In this talk, I will be sharing about common bottlenecks in data processing within a typical data science workflow, and exploring the use of parallel and asynchronous programming using concurrent.futures module in Python to speed up your data processing pipelines so that you could focus more on getting value out of your data. Through real-life analogies, you will learn about:"], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Data", "Data Science", "Multi-Processing", "Multi-Threading"]},
{"title": ["Sharing Reproducible Python Environments with Binder"], "author": ["Sarah Gibson"], "description": ["As reproducibility gains traction in the data science and research communities, the need to package code, data and the computational environment is growing."], "date": "July 2020", "tags": ["Best Practice", "Data Science", "Jupyter", "Open-Source", "Public Cloud (AWS/Google/...)"]},
{"title": ["Serverless 2.0 with Cloudstate.io-stateful functions with Python"], "author": ["Sean Walsh"], "description": ["Serverless is revolutionary and will dominate the future of Cloud. Function-as-a-Service (FaaS) however—with its stateless and short-lived functions is only the first step. "], "date": "July 2020", "tags": ["Cross-Platform-Development", "Development", "Distributed Systems", "Public Cloud (AWS/Google/...)"]},
{"title": ["So, You Want to Build an Anti-Virus Engine?"], "author": ["JunWei Song", "KunYu Chen"], "description": [], "date": "July 2020", "tags": ["Mobile", "Open-Source", "Security", "Static Analysis"]},
{"title": ["ScanAPI"], "author": ["Camila Maia"], "description": ["In the current IT scenario, the use of APIs is, without question, widely vast, popular, and significant. It seems at least prudent to ensure they are working properly, as expected. To guarantee the quality of the data that is being consumed or used. To ensure that communication between services is occurring as expected. To ensure the system does, in fact, what it should do."], "date": "July 2020", "tags": ["APIs", "Open-Source", "RESTful", "Test Libraries (pytest/nose/...)", "Testing"]},
{"title": ["Running Unit Test on Top of Serverless Service"], "author": ["Adinata Thayib"], "description": ["I will share on how to utilize serverless architecture for a less common scenario - unit testing.", "As part of the talk, we will also discuss different approaches to parallelizing unit test suite execution.", "Attendees will also learns on cost-benefit analysis related to increasing developer productivity."], "date": "July 2020", "tags": ["Case Study", "Multi-Processing", "Public Cloud (AWS/Google/...)", "Test Libraries (pytest/nose/...)", "Tooling"]},
{"title": ["Real Time Stream Processing for Machine Learning at Massive Scale"], "author": ["Alejandro Saucedo"], "description": ["This talk will provide a practical insight on how to build scalable data streaming machine learning pipelines to process large datasets in real time using Python and popular frameworks such as Kafka, SpaCy and Seldon."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Best Practice", "Big Data", "Distributed Systems", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Running EuroPython 2020 as an online conference"], "author": ["Marc-Andre Lemburg"], "description": ["We had been planning the EuroPython 2020 conference in Dublin, Ireland ever since late in 2019, when we ran the CFP. In March, it became apparent that the COVID-19 crisis would not be over by July 2020 and so we had to make a hard decision to either drop the event for 2020 or go online."], "date": "July 2020", "tags": ["Community", "EuroPython", "EuroPython Society (EPS)", "The Answer to Life the Universe and Everything Else"]},
{"title": ["Roadmap to an Open Source Artificial Pancreas & Diabetes monitoring with Flask"], "author": ["Diana Rodriguez Manrique"], "description": ["Open Source has crossed frontiers and is widely used to solve problems in the health & science fields. In this talk we’ll learn about the many moving parts of continuous glucose monitoring for type 1 Diabetes as part of the open-source artificial pancreas project and building a notifier for the most used OSS continuous glucose monitoring dashboard: Nightscout."], "date": "July 2020", "tags": ["Beginners", "Communication", "DIY", "Development", "Open-Source"]},
{"title": ["Ray: A System for High-performance, Distributed Python Applications"], "author": ["Dean Wampler"], "description": ["Ray (", ") is an open-source, distributed framework from U.C. Berkeley’s RISELab that easily scales Python applications from a laptop to a cluster. While broadly applicable, it was developed to solve the unique performance challenges of ML/AI systems, such as the heterogeneous task scheduling and state management required for hyperparameter tuning and model training, running simulations when training reinforcement learning (RL) models, and model serving. Ray is now used in many production deployments. "], "date": "July 2020", "tags": ["Architecture", "Data", "Deep Learning", "Distributed Systems", "Microservices"]},
{"title": ["Python Table Manners: Cut the Cookie Gracefully"], "author": ["Wei Lee"], "description": ["### Goals", "I expect the audiences to gain knowledge of the tools I mention and the primary usage of them. The tools will cover various aspects of software engineering (e.g., dependencies, testing, security, etc.). Also, I'll purpose how I combine all these tools in my development workflow as a sample for how the audiences can integrate these tools into their workflow."], "date": "July 2020", "tags": ["Best Practice", "General", "Programming", "Tooling"]},
{"title": ["Python Memory Management 101"], "author": ["J.M. Ortega"], "description": ["I will review the main mechanims for memory allocation and how the garbage collector works in conjunction with the memory manager for reference counting of the python objects.Finally, I will comment the best practices for memory managment such as writing efficient code."], "date": "July 2020", "tags": ["Best Practice", "Development", "Management", "Python Skills"]},
{"title": ["Python Emergency Remote Teaching"], "author": ["Fernando Masanori Ashikaga"], "description": ["During the pandemic lockdown of COVID-19, we found a very different context from the usual: a) students with much more time available for learning b) many students who did not have a personal computer and could only access classes by cell phone c) difficulty to realistically assess learning. In this lecture we will present the real experiences in a traditional programming course given during the Covid-19 pandemic."], "date": "July 2020", "tags": ["Beginners", "Case Study", "Community", "Education"]},
{"title": ["pyRT - Computer Graphics in Jupyter Notebooks for Fun and Teaching"], "author": ["Martin Christen"], "description": ["PyRT (pronounced pirate) is a raytracer/image generator for Python 3.5 and higher. This project is mainly done with the following in mind:"], "date": "July 2020", "tags": ["3D", "Education", "GEO and GIS", "Teaching", "Virtualization"]},
{"title": ["Probabilistic Forecasting with DeepAR and AWS SageMaker"], "author": ["Nicolas Kuhaupt"], "description": ["In time series forecasting we are interested in how the time series is going to continue in the future. This is of high importance in areas like forecasting energy production from renewable resources, forecasting demand of customers or the price of products. Many forecasting algorithms provide only the prediction. However, oftentimes we are also interested in the likelihood of the prediction and how much it may vary. This is what probabilistic forecasting is for. With every forecast, we also obtain an upper and lower bound with certain probabilities. For a long time, probabilistic forecasting was limited to traditional techniques like ARIMA. DeepAR is an algorithm that allows us to combine Deep Learning techniques with probabilistic forecasting. Additionally, in contrast to training a model for each time series individually, DeepAR suggests training one large forecasting model for all related time series. The algorithm was developed by Amazon and is also provided in AWS SageMaker. ", "In this talk, we will understand the theoretical basics of DeepAR, have a look at a practical time series example and will demonstrate an implementation. In the end, you will be prepared to get started with your own forecasts."], "date": "July 2020", "tags": ["Data Science", "Deep Learning", "Machine-Learning", "Predictions", "Public Cloud (AWS/Google/...)"]},
{"title": ["Practical Optimisations for Pandas"], "author": ["Eyal Trabelsi"], "description": ["Writing performant pandas code is not an easy task, in this talk I will explain how to find the bottlenecks and how to write proper code with computational efficiency, and memory optimisation in mind."], "date": "July 2020", "tags": ["Best Practice", "Data", "Data Science"]},
{"title": ["Pluggable Architecture"], "author": ["Aly Sivji"], "description": ["Applications and libraries with a pluggable architecture allow developers to add custom functionality. Plugins can customize user interfaces, create new workflows, and interface with legacy systems. Designing a plugin is often difficult - documentation is sparse, outdated, or non-existent. You end up diving into a unfamiliar codebase to figure out what to do."], "date": "July 2020", "tags": ["Abstractions", "Architecture", "Development", "Software Design", "System Architecture"]},
{"title": ["Painting with GANs: Challenges and Technicalities of Neural Style Transfer"], "author": ["Anmol Krishan Sachdeva"], "description": ["A lot of advancements are happening in the field of Deep Learning and Generative Adversarial Networks are one of them. We have seen GANs being applied for photo editing and in-painting, generating new image datasets and realistic photographs, increasing resolution of images (Super Resolution), and many more things. Some people have also exploited GANs for generating fake content. All the above-mentioned examples are result of a technique where the focus is to generate uncommon yet original samples from scratch. However, these examples have very less commercial applications and GANs are capable of doing much more. The focus of this talk is a technique called \"Neural Style Transfer (NST)\" which has numerous commercial applications in the gaming world, fashion/design industry, mobile applications, and many more fields. Challenges and technicalities of NSTs will be covered in great detail. We will teach the machines on how to paint images and utilize Style Transfer networks to generate artistic artefacts."], "date": "July 2020", "tags": ["Computer Vision", "Deep Learning", "Generative Adversarial Networks", "Image Processing", "Machine-Learning"]},
{"title": ["Overcoming access control in web APIs"], "author": ["Adam Hopkins"], "description": ["Great, you've developed a great web API. Awesome, you are about to deploy it. But, how do you secure it and manage access?"], "date": "July 2020", "tags": ["APIs", "Authentication", "Best Practice", "RESTful", "Web"]},
{"title": ["Painless Machine Learning in Production"], "author": ["Chase Stevens"], "description": ["Developing machine learning models is easy; training, deploying, monitoring, scaling, and maintaining them in an automated fashion - all while maintaining your sanity - is hard. "], "date": "July 2020", "tags": ["Case Study", "Data Science", "DevOps general", "Infrastructure", "Machine-Learning"]},
{"title": ["NLPeasy - a Workflow to Analyse, Enrich, and Explore Textual Data"], "author": ["Philipp Thomann"], "description": ["Ever wanted to try out NLP methods but it felt it too cumbersome to set up a workflow for textual data? How to enrich your data based on textual features and explore the results?"], "date": "July 2020", "tags": ["Data Science", "Elastic Search", "Machine-Learning", "Natural Language Processing"]},
{"title": ["Migrating codebases with millions of modules from Python 2 to Python 3"], "author": ["Francisco Passos"], "description": ["This has been mitigated with tooling and education, but for the most part it requires human action and decision. While most codebases have somewhere between tens and thousands of Python modules, some companies may maintain a codebase with millions of modules. This presentation covers techniques and tooling that Google created to enable the developers to scope their migration needs, plan the work required, execute effectively at scale and collaborate across teams/dependencies."], "date": "July 2020", "tags": ["Best Practice", "Python 2", "Python 3"]},
{"title": ["Object Internals"], "author": ["Mridu Bhatnagar"], "description": ["This talk is intended to explain to participants what is happening under the hood when they are playing around with different python built-in data structures. Explain the concepts such that they are not surprised by the behavior of Python."], "date": "July 2020", "tags": ["Data-Structures", "Development", "Python 3"]},
{"title": ["Mastering a data pipeline with Python: 6 years of learned lessons from mistakes"], "author": ["Robson Junior"], "description": ["Building data pipelines are a consolidated task, there are a vast number of tools that automate and help developers to create data pipelines with few clicks on the cloud. It might solve non-complex or well-defined standard problems. This presentation is a demystification of years of experience and painful mistakes using Python as a core to create reliable data pipelines and manage insanely amount of valuable data. Let's cover how each piece fits into this puzzle: data acquisition, ingestion, transformation, storage, workflow management and serving. Also, we'll walk through best practices and possible issues. We'll cover PySpark vs Dask and Pandas, Airflow, and Apache Arrow as a new approach."], "date": "July 2020", "tags": ["Beginners", "Big Data", "Case Study", "Data Science", "Open-Source"]},
{"title": ["Making Pandas Fly"], "author": ["Ian Ozsvald"], "description": ["Larger datasets can't fit into RAM - suddenly you can't use Pandas any more - but we need to analyse that data! First we'll review techniques to compress our data (maybe cutting our DataFrame RAM usage in half!) so we can process more rows using regular Pandas. Next we'll look at clever ways to make common operations run faster on DataFrames including dropping down to numpy, compiling with Numba and running multi-core. Finally for still-larger datasets we'll review Dask on Pandas and the new Vaex competitor solution. You'll leave with new techniques to make your DataFrames smaller and ideas for processing your data faster.", "This talk is inspired by Ian's work updating his O'Reilly book High Performance Python to the 2nd edition for 2020. With over 10 years of evolution the Pandas DataFrame library has gained a huge amount of functionality and it is used by millions of Pythonistas - but the most obvious way to solve a task isn't always the fastest or most RAM efficient. This talk will help any Pandas user (beginner or beyond) process more data faster, making them more effective at their jobs."], "date": "July 2020", "tags": ["Big Data", "Data Science", "Multi-Processing", "Performance", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Machine Learning for Everyone"], "author": ["Aaron Ma"], "description": ["Machine learning (ML) is becoming an essential technology for our day to day life. Stop taking ML as a threat and learn it today as not learning it is a HUGE LOSS! Get started today with ML in Aaron's remarkable 45-mins talk. We will begin by talking about the paradigm of ML, then taking a deep dive into Neural Networks and building a Neural Network from scratch with Keras and TensorFlow (the hottest machine learning framework). You'll master the magic of neural networks that are powering incredible advances both in AI, self-driving cars, and much more! Finally, we will finish off by talking about Reinforcement learning and how it is empowering YouTube suggestions along with tips-and-tricks from a specialist plus a grand finale mind-blowing demo. Ready to master the paradigm of ML? Let's get started."], "date": "July 2020", "tags": ["Beginners", "Deep Learning", "General", "Machine-Learning"]},
{"title": ["Live-coding a music synthesizer"], "author": ["Ram Rachum"], "description": ["This is going to be a fun live-coding session using NumPy and SoundDevice. The goal of this talk is to make the computer produce realistic-sounding instrument sounds, using nothing but math."], "date": "July 2020", "tags": ["Agile", "Algorithms", "Fun and Humor", "Physics", "PyPy"]},
{"title": ["Lessons from the Trenches: rewriting and re-releasing virtualenv"], "author": ["Bernat Gabor"], "description": ["virtualenv is a tool that builds virtual environments for Python. It was first created in September 2007 and lived most of its life being a single file project with an increasing amount of (scary) workarounds within. It managed to grow until it was 2,700 lines of code. Maintaining this project became increasingly more troublesome, to the point where, we had more than 500 open issues at one point. In July 2019, I started working from scratch on a rewrite, with the goal of not just increasing the project's maintainability, but also to make it faster and add some new features that were just impossible or too hard to do in the existing code base. Fast forward six months to January 2020, when we released the first beta, with the first full release coming out on 10th February. It took a bit more than a month to squash all the open bugs tickets, but April started without any remaining open bug tickets. This talk will cover the lessons I've learned while on this journey."], "date": "July 2020", "tags": ["Packaging", "Virtual Env", "python"]},
{"title": ["IPython: The Productivity Booster"], "author": ["Miki Tebeka"], "description": ["IPython seems like a fancy Python shell. Why do we need it when we have PyCharm, VSCode, and other IDEs?"], "date": "July 2020", "tags": ["Development", "Ipython"]},
{"title": ["HTTP/3 – Why should I care?"], "author": ["Miloslav Pojman"], "description": ["HTTP is the foundation of the current web, and HTTP/3 is the upcoming major version of it. The new version is built on top of the QUIC transport protocol, originally developed in Google."], "date": "July 2020", "tags": ["HTTP", "Internet", "Privacy", "Web", "Web Protocols"]},
{"title": ["IoTPy: Python + Streams + Agents for Streaming Applications"], "author": ["Kanianthra Chandy"], "description": ["Sensors, social media, news feeds, webcams and other sources generate streams of data which are analyzed to control actuators, generate alerts, and feed displays. These applications process streams on onboard computers, such as the Raspberry Pi, connected directly to sensors, and send summarized information to the cloud for further processing. These applications have two characteristics: (1) Concurrency: The applications are concurrent using multiple threads to connect to sensors and actuators, shared memory across multiple processes on multicore machines and message passing for distributed systems spanning multiple computers. (2) Data Analysis: The applications use programs from a variety of libraries including those for signal processing, machine learning and natural language processing."], "date": "July 2020", "tags": ["Distributed Systems", "Internet of Things (IoT)", "Messaging and Job Queues (RabbitMQ/Redis/...)", "Scientific Libraries (Numpy/Pandas/SciKit/...)", "Sensors"]},
{"title": ["Interactive Mapmaking with Python"], "author": ["Sangarshanan Veeraraghavan"], "description": ["GeoDataframes are awesome for working with GIS data in Python as it provides the goodness of pandas for geographic data but So let's use them to create some cool interactive maps  "], "date": "July 2020", "tags": ["GEO and GIS", "Open-Source", "Visualization"]},
{"title": ["How to write multi-paradigm code"], "author": ["Elias Mistler"], "description": ["Python is a powerful multi-paradigm language which combines elements of object-orientation and functional programming. Both concepts can be really powerful if used right. But what if you use them together? It can be pragmatic and very efficient, but things can also get messy really quickly."], "date": "July 2020", "tags": ["Abstractions", "Architecture", "Best Practice", "Clean Code", "Functional Programming"]},
{"title": ["How to sort anything"], "author": ["Reuven Lerner"], "description": ["Sorting is one of those things that we take for granted in Python. The built-in \"sorted\" function knows how to sort any iterable of objects that are themselves sortable."], "date": "July 2020", "tags": ["Data", "Development", "Functional Programming"]},
{"title": ["How to Run a Corridor Track in a Remote Conference with Python"], "author": ["Nicholas Tollervey"], "description": ["One of the best aspects of any conference, and EuroPython in particular, is the corridor track. It's when you walk around the physical conference venue and bump into an old buddy, find yourself striking up a conversation with a friendly co-attendee in the coffee queue, or join a huddle of welcoming folks discussing something interesting. The corridor track is where the community comes alive."], "date": "July 2020", "tags": ["Conferences and Meet-Ups", "Fun and Humor", "Game-Development", "Python general"]},
{"title": ["How to be Pythonic? Design a Query Language in Python"], "author": ["Cheuk Ho"], "description": ["Query language is an important part of a database system, it is how people manage their data and how they can make the data useful to them. Starting from the 70s, the world is full of relational databases and SQL was the way to make queries. However, SQL is valuable to an injection attack. Lots of efforts are being used to stop those attacks and it made workflow become less efficient."], "date": "July 2020", "tags": ["APIs", "Databases", "Graph Databases", "Open-Source", "Programming"]},
{"title": ["How to Avoid Becoming a 10x Engineer"], "author": ["Ivana Kellyerova"], "description": ["The internet has never failed at being, among other things, a giant treasure of unsolicited advice by random people on all sorts of things, programming being no exception. Wanna become a better coder? Learn to maximize your WPM (c). Never look at documentation because that's just embarrassing. And for crying out loud, change your screen background to black!"], "date": "July 2020", "tags": ["Best Practice", "Programming", "The Answer to Life the Universe and Everything Else"]},
{"title": ["Digital Transformation in the fight against Coronavirus"], "author": ["Bruno Ferreira"], "description": ["The Corona Virus - COVID-19 pandemic caused a significant impact on public services. In particular, it brought a massive digitalization of services that were offered in person. In addition, there was a great deal of pressure on official channels, whether to seek a service or to report a fact. Qualified and official information becomes an element in combating the pandemic. Knowing where to look for information, reporting a fact or getting a qualified response are essential steps to maximize the efficiency of the citizen's decision-making process, especially in a scenario of such uncertainty. The State has a fundamental role, whether as an inducer, executor or provider of the means necessary for information and decision-making to be effective at that time.", "Connected by the growing demand, the State of Goiás, through the State's Comptroller General, published a series of technological tools with the objective of bringing information to the citizen, promoting social control and improving public policies to fight the Coronavirus.", "This document seeks to show how technological tools were adopted and implemented in terms of transforming the ombudsman channels in the State of Goiás through the State's Comptroller General in actions to combat the Coronavirus pandemic. The document seeks to show how the transformation of the ombudsman channels occurred through machine learning techniques and data visualization."], "date": "July 2020", "tags": ["PyPi", "PyPy", "Python Skills", "Python general", "R"]},
{"title": ["Difficulties of Python code development:packages,virtualenvs and package mangers"], "author": ["Michał Wodyński"], "description": ["In this presentation I will show different packages that are used in Python. I will point out differences and explain the prons and cons of using them during code development. ", "\tAfter that we will jump to the topic of virtualenvs and  popular tools that are used for managing them. I will explain what is purpose of the virtualenvs in Python and why we should use them.", "\tFinally we will focus on the most important topic without which development is not possible – package mangers. Package managers it is wide topic in Python world. There is many package mangers and  currently we have tools like pip, pipenv or poetry but it is not obvious which of them we should use in first place. Which of them are recommended to use? What are prons and cons of certain package mangers? Is there any other not well known packages mangers? How package mangers are packaging Python code? Which of the package mangers are good for data scientists? Is your package manger is resolving dependencies? ", "\tThis questions can appear especially when you are beginner and just to want start working with Python. Unfortunately form the beginning you must face the problem which of the package manger you should use. In this presentation I will answer all of this questions. I will list popular package mangers and some not known. I will show differences and which of them are best for which case. Also I will explain differences between packages that are used by different packages mangers. If you are interested in code development and package mangers or you are just confused which of them you should use this presentation is definitely for you. During this presentation I will answer all questions and I will wipe out all doubts about packages, package mangers and virtualenvs."], "date": "July 2020", "tags": ["Beginners", "Conda / conda forge", "Development", "Packaging", "Virtual Env"]},
{"title": ["Diffprivlib: Privacy-preserving machine learning with Scikit-learn"], "author": ["Naoise Holohan"], "description": ["Data privacy is having an ever-increasing impact on the way data is stored, processed, accessed and utilised, as the legal and ethical effects of data protection regulations take effect around the globe. Differential privacy, considered by many to be the strongest privacy guarantee currently available, gives robust, provable guarantees on protecting privacy, and allows tasks to be completed on data with guarantees on the privacy of individuals in that data. This naturally extends to machine learning, where training datasets can contain sensitive personal information, that are vulnerable to privacy attacks on trained models.", "By using differential privacy in the training process, a machine learning model can be trained to accurately represent the dataset at large, but without inadvertently revealing sensitive information about an individual. Diffprivlib is the first library of its kind to leverage the power of differential privacy with scikit-learn and numpy to give data scientists and researchers access to the tools to train accurate, portable models with robust, provable privacy guarantees built-in.", "In this talk, we will introduce attendees to the idea of differential privacy, why it is necessary in today's world, and how diffprivlib can be seamlessly integrated within existing scripts to protect your trained models from privacy vulnerabilities. Attendees will be expected to have a basic understanding of sklearn (i.e., how to initialise, fit and predict a model). No knowledge of data privacy or differential privacy will be assumed or required."], "date": "July 2020", "tags": ["Data Privacy", "Data Protection", "Machine-Learning", "Open-Source", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Developing GraphQL API in Django using Graphene"], "author": ["Nisarg Shah"], "description": ["GraphQL technology has become popular nowadays. While developing REST APIs, there are many things that developers need to take into consideration. There are multiple endpoints and over-fetching is the main problem of REST. GraphQL offers a unique approach and architecture for developing APIs. How is that efficient?"], "date": "July 2020", "tags": ["APIs", "Databases", "Django", "PostgreSQL", "Python 3"]},
{"title": ["Detecting and Analyzing Solar Panels in Switzerland using Aerial Imagery"], "author": ["Adrian Meyer"], "description": ["A novel method for detecting solar panels and its geometry on aerial imagery is presented. Deep Learning with PyTorch is being used for segmentation. The goal is to know the exact locations, dimensions and potential of every solar installation in Switzerland. It is shown how we labelled the data and how we found a solution to distinguish different solar panel types."], "date": "July 2020", "tags": ["Deep Learning", "Machine-Learning"]},
{"title": ["Deploy your Machine Learning Bots like a boss with CI/CD"], "author": ["William Arias"], "description": ["Context: Today is relatively easy to create and train a conversational agent using Machine Learning Techniques, fire it up and showcase it in your computer"], "date": "July 2020", "tags": ["Deep Learning", "Deployment/Continuous Integration and Delivery", "Ipython", "Machine-Learning", "Open-Source"]},
{"title": ["Deceptive Security using Python"], "author": ["Gajendra Deshpande"], "description": ["Imagine you are passing through an unknown street at midnight and you find that some anti-social elements are following you. To save yourself from them you start running and look for a safe place to hide. On the way, you will find a good person and requests him to help you. He hides you in his place to protect you. When these anti-social elements visit a good person’s place and enquire about you, the good person misguides them and redirects them to some other place in order to protect you. This is exactly how deception works. In this analogy, YOU are the resources to be protected, anti-social elements are the hackers who want to gain access to the resources, and a good person is a deception technique that protects the resources from hackers by making them fall in the trap."], "date": "July 2020", "tags": ["Beginners", "Machine-Learning", "Security", "python"]},
{"title": ["Decade of PyCon JP: How we spread the Python community in Japan"], "author": ["Takanori Suzuki"], "description": ["- Overview", "  - The history of PyCon JP has been 10 years since 2010", "  - The conference itself has started up → expanded in scale → stabilized", "  - At the same time, we are working on spreading Python throughout Japan.", "  - And what to do in the future", "- History of PyCon JP", "  - The origin of PyCon JP was PyCon APAC 2010 in Singapore", "  - We have been holding PyCon JP every year since 2011", "    - Our first PyCon was PyCon mini JP in 2011", "    - We invited PyCon APAC from Singapore in 2013", "  - Participants are increasing steadily", "  - There is English tracks and Japanese talks", "- 2013: Association", "  - Purpose: We have established a legal entity to make it easier to manage money and contracts for PyCon JP event ", "  - I have been a director since 2013", "- 2014-1016: Chair od PyCon JP event", "  - I was the chair of PyCon JP event from 2014 to 2016", "  - Purpose: Open management", "  - I opened every staff meeting to make it easier for new staff to join", "  - We created an operation manual and made it reusable", "  - We regularly publish our activities on the blog to get interested in event management", "- 2015-: PyCon mini", "  - Small PyCons in the region were held in Sapporo and Hiroshima in 2015", "  - It has been held in various places such as Kumamoto and Osaka", "  - PyCon Kyushu is held all over Kyushu(Fukuoka -> Okinawa -> Kumamoto)", "  - We have been sharing operating know-how and supporting money and people", "  - We have also provided a subdomain of pycon.jp", "- 2016-: Python Boot Camp", "  - Objective: We visit all over Japan to teach Python → We connect with local people → We hope local communities to start up", "  - We teach an introduction to Python programming in half a day", "  - We hold 40 times in 3.5 years with 950 local participants", "  - We hold in cooperation with local staff and local teachig assistants", "  - Result: Some local communities have been created", "  - PyCon JP has more people coming from local area", "- 2019: Python Boot Camp Caravan, Regional Meetup", "  - Purpose: To strengthen the connection between local communities", "  - A regional meetup was held at PyCon JP 2019 with local community members", "  - About 30 people gathered from all over Japan for this event", "  - We had various discussions and shared ideas and worries", "  - We hold local meetups online", "  - We hold the first online meeting using Zoom, with 15 participants from all over Japan", "- Future", "  - We want to hold PyCon JP outside of Tokyo", "  - We want to conquer all prefectures at Python Boot Camp", "  - We want PyCon mini to be held all over Japan", "- Summary", "  - We have spread Python throughout Japan with various activities", "  - I think it's important to meet", "  - First we go to meet local people", "  - Reunion strengthens relationship"], "date": "July 2020", "tags": ["Community"]},
{"title": ["Cultivating a Culture of Creativity, Collaboration, and Captainship"], "author": ["Amber Vanderburg"], "description": ["In my work as a consultant, coach, and organizational leader- I work with amazing companies around the world, helping them craft and implement strategies to build high-performing teams."], "date": "July 2020", "tags": ["Agile", "Best Practice", "Business", "Community", "DevOps general"]},
{"title": ["Creating the Next Generations of Billionaires - Part 2"], "author": ["lil anonymous"], "description": ["Our generation of young people in school (aged 5-18) have noticed the connection between Computer pRogramming, Technology, Success and Billionaires. On mass they are clamouring to master the skill of Computer pRogramming. It  has been dubbed the ‘4th’ R’ (computer pRogramming) along with Reading, wRiting and aRithmetic. So, governments worldwide have launched initiatives to have it taught in schools from Kindergarten to all the way to high school."], "date": "July 2020", "tags": ["Education", "General", "Python 3", "Science", "Teaching"]},
{"title": ["Creating an inclusive team culture in times of change"], "author": ["Yenny Cheung"], "description": ["What can we do as technical leaders to make sure everyone feels accepted and build a supportive team culture during the turbulent times? This talk shares concrete steps that we can take to lead by example, and navigate our team through crisis:"], "date": "July 2020", "tags": ["Communication", "Community", "Diversity", "Management"]},
{"title": ["Community-oriented conference status during COVID-19"], "author": ["Noah Chen"], "description": ["due to COVID-19(Coronavirus disease 2019), we changed our life, social, and our community. most of us are engineer/organizer/designer/contributor with passion to communicate to everyone who has similar background. in COVID-19 disease, we are forced to reduce social event for keeping safe. in case from China/Korea/Malaysia.... we can see the number is decreasing and be controlled after each government announced new policy: Face masked, Social Distancing, Quarantine, and Isolation. it meant we can not go to some place to hangout like usual, of course we have a lot of SMS tools/platform/media to keep relationship with our love, but for community, we easily lost our passion. and now, I want to share some doing/status of communities in Asia or other region I knew during/after COVID-19."], "date": "July 2020", "tags": ["Communication", "Community", "EuroPython", "freelancing"]},
{"title": ["Corona-Net"], "author": ["Ching Lam Choi"], "description": ["Identified in December 2019, the novel Coronavirus has infected 2.7 million worldwide, and claimed the lives of 0.2 million. Amidst this deadly pandemic, I started my open source project, Corona-Net, in the hopes of contributing to the global fight against the Coronavirus. Corona-Net is a 3-part project dedicated to the classification, binary segmentation and multi-class segmentation of COVID-19. I first leverage the EfficientNet model for COVID-19 diagnosis, then utilise and refine the U-Net architecture for both binary and 3-class (ground-glass, consolidation, pleural effusion) segmentation of COVID-19 symptoms, through inference on the COVID-19 CT segmentation (chest axial CT) dataset. Through Corona-Net, I aim to develop a reliable, visual-semantically balanced method for automatic COVID-19 diagnosis, as well as extend an invitation to all to collaborate and stand together against this pandemic. My PyTorch code is publicly available at ", "."], "date": "July 2020", "tags": ["Computer Vision", "Data Science", "Deep Learning", "Image Processing", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["Clean Architectures in Python"], "author": ["Leonardo Giordani"], "description": ["Architectural considerations are often overlooked by developers or completely delegated to a framework. We should start once again discussing how applications are structured, how components are connected and how to lower coupling between different parts of a system, to avoid creating software that cannot easily be maintained or changed."], "date": "July 2020", "tags": ["Abstractions", "Architecture", "Clean Code", "Development", "TDD"]},
{"title": ["Can we deploy yet?"], "author": ["Anastasiia Tymoshchuk"], "description": ["What happens when your features are done, your MVP is ready and you want to deploy your first production build? What do you do then? How do you make your first production build instead of re-using your development one? is your code ready to handle real user interactions?", "This talk will show a production ready checklist for your Python code; what to look for when creating a production-ready Docker image; what are the differences between development and production environments and builds.", "You will see how to deal with exceptions, logs, and metrics with real-world use cases."], "date": "July 2020", "tags": ["Architecture", "Best Practice", "Clean Code", "Development", "Documentation"]},
{"title": ["Building The Perfect Personalised Menu Using Python"], "author": ["Irene Iriarte"], "description": ["This talk will describe how Gousto, a leading recipe box service based in the UK, is using python to build a personalisation ecosystem. Our menu planning optimisation algorithm allows us to create the perfect mix of recipes, ensuring a variety of dish types, cuisines and ingredients. Our recommendation engine sitting on top of this can then offer each customer a personally curated menu, making sure that users have meaningful choice. All this while ensuring that we are also optimising for maximum performance from the operations point of view! "], "date": "July 2020", "tags": ["Algorithms", "Case Study", "Data Science", "E-Commerce", "Machine-Learning"]},
{"title": ["Building smarter solutions with no expertise in machine learning"], "author": ["Laurent PICARD"], "description": ["ML? API? AutoML? Python is the language of choice to solve problems with machine learning, but what can we build in only a few hours or days and without any expertise? In this session, we'll see how to benefit from existing ML models and how to create a custom model with AutoML techniques. We’ll also be active players of a live demo, so don't put your smartphone on airplane mode!"], "date": "July 2020", "tags": ["Computer Vision", "Human-Machine-Interaction", "Machine-Learning", "Natural Language Processing", "Public Cloud (AWS/Google/...)"]},
{"title": ["Building reproducible distributed applications at scale"], "author": ["Fabian Höring"], "description": ["Packaging in Python is hard. Packaging is particularly hard when code needs to run in a distributed computing environment where it is difficult to know what runs where and which parts of the code are available to run there. "], "date": "July 2020", "tags": ["Big Data", "Distributed Systems", "Packaging", "Virtual Env"]},
{"title": ["Building quantum applications with D-Wave's Leap"], "author": ["Alexander Condello"], "description": ["In the past, quantum computing was largely reserved for researchers, physicists, and scientists with direct access to physical quantum computing systems. But the game has changed, thanks to the cloud. Barriers to quantum computing are coming down quickly."], "date": "July 2020", "tags": ["Community", "Jupyter", "Machine-Learning", "Other Hardware", "Python general"]},
{"title": ["Bringing your Python script to more users!"], "author": ["Takuya Futatsugi"], "description": ["It is wonderful to automate boring stuffs with Python.", "In Japan, new introductory books are being published every month and more and more Pythonistas are working on automation.", "A Python script that is useful to you may be useful to others.", "So I talk about how to enable others to use your script."], "date": "July 2020", "tags": ["Beginners", "Command-Line", "Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["Boosting simulation performance with Python"], "author": ["Eran Friedman"], "description": ["Our product uses a fleet of real (not virtual) robots to perform different tasks in a fulfillment warehouse. Simulation is an essential tool in this kind of product: it allows to perform regression tests and test new features without the need for real and expensive hardware, to compare the impact of different algorithms and optimizations, to inject failures, and more."], "date": "July 2020", "tags": ["Architecture", "Robotics", "Testing"]},
{"title": ["Best practices for production-ready Docker packaging"], "author": ["Itamar Turner-Trauring"], "description": ["You know the basics of packaging your Python application for Docker, but do you know enough to run that image in production? Bad packaging can result in security and production problems, not to mention wasted time try to debug unreproducible errors."], "date": "July 2020", "tags": ["Deployment/Continuous Integration and Delivery", "DevOps general", "Docker", "Packaging", "Security"]},
{"title": ["Automating machine learning workflow with DVC"], "author": ["Hongjoo Lee"], "description": ["As software engineers work on CI/CD process as soon as they start a new project, data scientists and ML engineers define a pipeline for data as it flows through a typical workflow. Each step of the pipeline is fed data processed from its preceding step as CI/CD process starts from code changes. "], "date": "July 2020", "tags": ["Big Data", "Data", "Data Science", "Deployment/Continuous Integration and Delivery"]},
{"title": ["Automate your tasks with Python and publish with Chat Apps"], "author": ["Anton Chernikov"], "description": ["The technology is to take script written in a high-level language (Python), analyze its inputs/outputs, images or graphs display, other interactions with the user and build connectors to this script from Chat Apps like Slack, Skype, and others. Imagine that you described your skill as a script and gave it to a software robot. And from that moment it is his skill, you and your colleagues can ask him any time to run this skill and give results. As a script author, you don't think about how to connect with different Chat Apps, how to control access, how to monitor that script works fine when colleagues run it, how to save logs, how to balance load if there are too many colleagues running script and so on, our platform does all of this so the author doesn't need to think about what is that software robot, how it works, the platform will understand script by itself. The author just drop script to the platform and tell to the platform which colleagues have the right to run this script."], "date": "July 2020", "tags": ["Best Practice", "Community", "Operations", "Workforce", "python"]},
{"title": ["Attractive GUIs with PySimpleGUI"], "author": ["Ruud van der Ham"], "description": ["In the Python landscape, there are several high-end GUI packages. Of course, there’s tkinter which is part of the standard library. And there is wxPython and several versions of Qt. What they share is that they are very flexible but not only have a steep learning curve but also take considerable development effort to realize even a simple user interface.", "At the other of the spectrum, there are several design tools that either generate code of a layout structure. In many cases, the functionality is rather limited, though.", "Relatively recent, an independent open-source developer (not me) has made a product that tries to bridge the gap between these two worlds: PySimpleGUI. This package runs on top of tkinter, QT for Windows, wxPython and Remi.", "In this talk, I want to show the design methodology behind this fascinating product that might change the way people look at GUIs.", "I will start with live coding a simple yet not evident program that shows the basic concepts. With this, I will demonstrate the design philosophy.", "PySimpleGUI can also be used to implement a user-friendly interface as opposed to command-line interfaces.", "From there, I will give an overview of some more elements present in this package.", "Finally, I will show a full-featured GUI program with several bells and whistles."], "date": "July 2020", "tags": ["Beginners", "General", "Human-Machine-Interaction", "python"]},
{"title": ["API-schema-based testing with schemathesis"], "author": ["Alexander Hultnér"], "description": ["The goal with this talk is to introduce the audience to property-based testing for API’s using schemas to automatically generate test scenarios, enabling them to write more powerful tests faster. "], "date": "July 2020", "tags": ["APIs", "RESTful", "Test Libraries (pytest/nose/...)", "Testing", "Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["An ASGI Server from scratch"], "author": ["Philip Jones"], "description": ["I intend for this to be a fairly advanced talk that shows the steps required to go from a TCP echo server to a basic HTTP/1 ASGI server using asyncio for the IO. This is aimed at people who've read about asyncio, coroutines, etc and want to see them used in practice."], "date": "July 2020", "tags": ["ASYNC / Concurreny", "Web", "Web Protocols", "Web Servers and MicroFWs (Flask/Tornado/Nginx/...)"]},
{"title": ["Advanced Infrastructure Management in Kubernetes using Python"], "author": ["Gautam Prajapati"], "description": ["Many of us are using Kubernetes in production. A Kubernetes Operator is a way to automate packaging, deploying, and managing of a Kubernetes Application. It is a software alternative to a human operator who has deep knowledge of how to set up, deploy, and manage a particular piece of infrastructure and what to do if it isn’t behaving correctly. Let’s see how we can automate all of this while staying in the Python ecosystem."], "date": "July 2020", "tags": ["DevOps general", "Distributed Systems", "Infrastructure", "Messaging and Job Queues (RabbitMQ/Redis/...)", "python"]},
{"title": ["Accessible Python education for schoolgirls using Avocados, Zombies, and Korean!"], "author": ["Chiin-Rui Tan"], "description": ["Imagine this school scenario: an entire year group of students aged 11-12, the majority completely new to coding, undergoing 6 hours of compulsory lessons on Python for Scientific Computing.    "], "date": "July 2020", "tags": ["Case Study", "Data Science", "Education", "Learning", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["A pythonic full-text search"], "author": ["Paolo Melchiorre"], "description": ["A full-text search on a website is the best way to make its contents easily accessible to users because it returns better results and is in fact used in online search engines or social networks."], "date": "July 2020", "tags": ["Django", "PostgreSQL", "Use Case", "Web"]},
{"title": ["A deep dive and comparison of Python drivers for Cassandra and Scylla"], "author": ["Alexys Jacob"], "description": ["This talk will explain the thread-per-core data architecture of Scylla and", "detail how we implemented \"shard-awareness\" in the Cassandra Python driver", "which allows to route queries down to the right CPU!"], "date": "July 2020", "tags": ["Databases", "NoSQL", "Python 3", "Scaling"]},
{"title": ["A Brief History of Jupyter Notebooks"], "author": ["William Horton"], "description": ["The Jupyter Notebook: many Python users love it, many other Python users love to hate it. But where did it come from? How did we come to have a tool that combines code execution, visualization, Markdown, and more? In this talk, we will dive into the development of the Jupyter Notebook and the older ideas that it built upon. "], "date": "July 2020", "tags": ["Data Science", "Ipython", "Jupyter", "Open-Source", "Scientific Libraries (Numpy/Pandas/SciKit/...)"]},
{"title": ["15 Things You Should Know About Spacy"], "author": ["Alexander Hendorf"], "description": ["spaCy is a free, open-source library for advanced Natural Language Processing (NLP) in Python.", "It was specifically designed for production use and it's a great tool to build applications that process text and help  to “understand” large corpuses. "], "date": "July 2020", "tags": ["Natural Language Processing", "Python 3"]},
{"title": ["Staying for the Community: Building Community in the face of Covid-19"], "author": ["Naomi Ceder"], "description": ["Python communities around the world, large and small are facing loss - from the loss of in person meetups and conferences to the loss of employment and even the potential loss of health and life. As communities we are all confronting uncertainty and unanswered questions. In this talk I would like to reflect on some of those questions. What are communities doing now to preserve a sense of community in the face of this crisis? What might we do and what options will we have for coming events? How can we build and foster community and still keep everyone safe? What challenges might we all face in the future? What sources of support can we find? What are our sources of optimism and hope?"], "date": "July 2020", "tags": ["Community", "Conferences and Meet-Ups"]},
{"title": ["Python in Prison: how open source can change a criminal justice system"], "author": ["Jessica McKellar"], "description": ["The United States has the highest incarceration rate in the world, with over 2.2 million people behind bars in our prisons, jails, juvenile facilities, and detention centers."], "date": "July 2020", "tags": ["Python 3", "Teaching"]},
{"title": ["Guido van Rossum Q&A"], "author": ["Guido van Rossum"], "description": ["Q&A session with Guido van Rossum, Creator of Python."], "date": "July 2020", "tags": ["Python general"]},
{"title": ["Meditations on First Deployment: A Practical Guide to Responsible Development"], "author": ["Alejandro Saucedo"], "description": ["As the impact of software increasingly reaches farther and wider, our professional responsibility as developers becomes more critical to society. The production systems we design, build and maintain often bring inherent adversities with complex technical, societal and even ethical challenges. The skillsets required to tackle these challenges require us to go beyond the algorithms, and require cross-functional collaboration that often goes beyond a single developer. In this talk we introduce intuitive and practical insights from a few of the core ethics themes in software including Privacy, Equity, Trust and Transparency. We cover their importance, the growing societal challenges, and how organisations such as The Institute for Ethical AI, The Linux Foundation, the Association for Computer Machinery, NumFocus, the IEEE and the Python Software Foundation are contributing to these critical themes through standards, policy advise and open source software initiatives. We finally will wrap up the talk with practical steps that any individual can take to get involved and contribute to some of these great open initiatives, and contribute to these critical ongoing discussions."], "date": "July 2020", "tags": ["Ethics", "Machine-Learning"]}
]